package org.daiitech.naftah.parser.provider.script;

import java.math.BigDecimal;
import java.math.BigInteger;
import java.util.HashSet;
import java.util.List;
import java.util.stream.Stream;

import org.daiitech.naftah.builtin.utils.Tuple;
import org.daiitech.naftah.errors.NaftahBugError;
import org.junit.jupiter.api.extension.ExtensionContext;
import org.junit.jupiter.params.provider.Arguments;
import org.junit.jupiter.params.provider.ArgumentsProvider;

import static org.daiitech.naftah.errors.ExceptionUtils.newExpressionsDeclarationsSizeMismatchErrorError;
import static org.daiitech.naftah.errors.ExceptionUtils.newSingleExpressionAssignmentError;
import static org.daiitech.naftah.errors.ExceptionUtils.newSpecifiedTypesExceedVariableNamesError;
import static org.daiitech.naftah.parser.DefaultContext.newNaftahBugVariableNotFoundError;

public class AssignmentProvider implements ArgumentsProvider {
	@Override
	public Stream<? extends Arguments> provideArguments(ExtensionContext context) throws Exception {
		return Stream
				.of(Arguments.of(true, """
										ثابت ت تعيين 2
										ت
										""", 2, null),
					Arguments.of(true, """
										متغير ش
										ش تعيين ١
										ش
										""", 1, null),
					Arguments.of(true, """
										متغير ع تعيين 15
										ع
										""", 15, null),
					Arguments.of(true, """
										ثابت ي تعيين ١
										ي
										""", 1, null),
					Arguments.of(true, """
										ثابت ت : أي_نمط تعيين 2
												ت
										""", 2, null),
					Arguments.of(true, """
										متغير ش : منطقي تعيين صائب
										ش
										""", true, null),
					Arguments.of(true, """
										متغير ع : تسلسل_رموز تعيين "15"
										ع
										""", "15", null),
					Arguments.of(true, """
										ثابت ي : بوليان تعيين خاطئ
										ي
										""", false, null),
					Arguments.of(true, """
										ثابت ز : حرف تعيين 'ث'
											ز
										""", 'ث', null),
					Arguments.of(true, """
										ثابت س : عدد_قصير_جدا تعيين ١
										س
										""", 1, null),
					Arguments.of(true, """
										ثابت ص : عدد_قصير تعيين 128
										ص
										""", 128, null),
					Arguments.of(true, """
										ثابت ه : عدد_صحيح تعيين 2147483647
										ه
										""", 2147483647, null),
					Arguments.of(true, """
										ثابت ض : عدد_صحيح تعيين 2147483648
										ض
										""", 2147483648L, null),
					Arguments.of(true, """
										ثابت ق : عدد_طويل تعيين 9223372036854775807
										ق
										""", 9223372036854775807L, null),
					Arguments.of(true, """
										ثابت ذ : عدد_طويل تعيين 9223372036854775808
										ذ
										""", new BigInteger("9223372036854775808"), null),
					Arguments.of(true, """
										ثابت ل : عدد_عائم تعيين 340282346638528860000000000000000000000,000000
										ل
										""", new BigDecimal("340282346638528860000000000000000000000.000000"), null),
					Arguments
							.of(true,
								"""
								ثابت ك : عدد_عائم_طويل تعيين 179769313486231570000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000,000000
								ك
								""",
								179769313486231570000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000.000000D,
								null),
					Arguments
							.of(true,
								"""
								ثابت ن : عدد_عائم_طويل تعيين 179769313486231570000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000001,000000
								ن
								""",
								new BigDecimal(
												"179769313486231570000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000001.000000"),
								null),
					Arguments
							.of(true,
								"""
								ثابت م : عدد_عائم_طويل تعيين 179769313486231570000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000001179769313486231570000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000001179769313486231570000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000001,000000
								م
								""",
								new BigDecimal(
												"179769313486231570000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000001179769313486231570000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000001179769313486231570000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000001.000000"),
								null),
					Arguments
							.of(true,
								"""
								متغير مجموعة_1 تعيين {١، ٢،  {١، ٢، ٣، ٤}، ٤}
								مجموعة_1[3][2] = {١، ٢، ٣، ٤}
								مجموعة_1[3][3]
								""",
								new HashSet<>() {
									{
										add(1);
										add(2);
										add(3);
										add(4);
									}
								},
								null),
					Arguments.of(true, """
										متغير قائمة تعيين [٨٥، ٩٠، ٧٨، ٩٢]
										قائمة[0] = [٨٥، ٩٠، ٧٨، ٩٢]
										قائمة[0][0] = [٨٥، ٩٠، ٧٨، ٩٢]
										قائمة[0][0][0] = [٨٥، ٩٠، ٧٨، ٩٢]
										قائمة[0][0][0][0] = [٨٥، ٩٠، ٧٨، ٩٢]
										قائمة[0][0][0][0][0] = [٨٥، ٩٠، ٧٨، ٩٢]
										قائمة[0][0][0][0][0]
										""", List.of(85, 90, 78, 92), null),
					Arguments
							.of(false,
								"""
								متغير تركيبة تعيين (٣٢، ٤٥)
								تركيبة[1] = {١، ٢، ٣، ٤}
								تركيبة[1]
								""",
								null,

								new NaftahBugError(
													"""
													لا يمكن استخدام الفهرسة إلا مع الأنواع التالية: قائمة أو مجموعة.
													""",
													2,
													0)),
					Arguments.of(true, """
										متغير المدينة تعيين {
										متغير الاسم تعيين "قبلي",
										متغير عدد_السكان تعيين 50000,
										متغير البلدة تعيين {
											متغير الاسم تعيين "سوق الأحد",
											متغير عدد_البيوت تعيين 400
										}
										}
										المدينة:البلدة:عدد_البيوت = 50
										المدينة:البلدة:عدد_البيوت
										""", 50, null),
					Arguments.of(false, """
										متغير المدينة تعيين {
										متغير الاسم تعيين "قبلي",
										متغير عدد_السكان تعيين 50000,
										متغير البلدة تعيين {
											متغير الاسم تعيين "سوق الأحد",
											متغير عدد_البيوت تعيين 400
										}
										}
										المدينة؟:ء:عدد_البيوت = 50
										المدينة؟:ء:عدد_البيوت
										""", null, newNaftahBugVariableNotFoundError("المدينة؟:ء")),
					Arguments.of(true, """
										متغير المدينة تعيين {
										متغير الاسم تعيين "قبلي",
										متغير عدد_السكان تعيين 50000,
										متغير البلدة تعيين {
											متغير الاسم تعيين "سوق الأحد",
											متغير عدد_البيوت تعيين 400
										}
										}
										المدينة["البلدة"]["عدد_البيوت"] = 50
										المدينة["البلدة"]["عدد_البيوت"]
										""", 50, null),
					Arguments.of(false, """
										متغير المدينة تعيين {
										متغير الاسم تعيين "قبلي",
										متغير عدد_السكان تعيين 50000,
										متغير البلدة تعيين {
											متغير الاسم تعيين "سوق الأحد",
											متغير عدد_البيوت تعيين 400
										}
										}
										المدينة؟["ء"]:عدد_البيوت = 50
										المدينة؟["ء"]:عدد_البيوت
										""", null, newNaftahBugVariableNotFoundError("المدينة؟:ء")),
					Arguments.of(true, """
										ثابت ت٫ش٬ع،ي تعيين "قبلي"؛400؛9223372036854775807؛(٣٢، ٤٥)
										(ت٫ش٬ع،ي)
										""", List.of("قبلي", 400, 9223372036854775807L, Tuple.of(32, 45)), null),
					Arguments
							.of(true,
								"""
								ثابت ت٫ش٬ع،ي: تسلسل_رموز؛عدد_طويل؛عدد_طويل؛أي_نوع تعيين "قبلي"؛400؛9223372036854775807؛(٣٢، ٤٥)
								(ت٫ش٬ع،ي)
								""",
								List.of("قبلي", 400, 9223372036854775807L, Tuple.of(32, 45)),
								null),
					Arguments
							.of(false,
								"""
								ثابت ت٫ش٬ع،ي؛ز,س؛ص٫ه٬ض،ق: منطقي٫تسلسل_رموز٫عدد_طويل٫عدد_عائم_طويل٫منطقي٫تسلسل_رموز٫عدد_طويل٫عدد_عائم_طويل٫منطقي٫تسلسل_رموز٫عدد_طويل٫عدد_عائم_طويل٫منطقي٫تسلسل_رموز٫عدد_طويل٫منطقي٫تسلسل_رموز٫عدد_طويل٫عدد_عائم_طويل٫منطقي٫تسلسل_رموز٫عدد_طويل٫عدد_عائم_طويل٫منطقي٫تسلسل_رموز٫عدد_طويل٫عدد_عائم_طويل٫منطقي٫تسلسل_رموز٫عدد_طويل٫عدد_عائم_طويل٫عدد_عائم_طويل تعيين "قبلي"؛400؛9223372036854775807؛(٣٢، ٤٥)
								(
								ت٫ش٬ع،ي؛ز,س؛ص٫ه٬ض،ق
								)
								""",
								null,
								newExpressionsDeclarationsSizeMismatchErrorError(1, 0)
							),
					Arguments
							.of(false,
								"""
								ثابت ت٫ش٬ع،ي؛ز,س؛ص٫ه٬ض،ق: منطقي٫تسلسل_رموز٫عدد_طويل٫عدد_عائم_طويل٫منطقي٫تسلسل_رموز٫عدد_طويل٫عدد_عائم_طويل٫منطقي٫تسلسل_رموز٫عدد_طويل٫عدد_عائم_طويل٫منطقي٫تسلسل_رموز٫عدد_طويل٫منطقي٫تسلسل_رموز٫عدد_طويل٫عدد_عائم_طويل٫منطقي٫تسلسل_رموز٫عدد_طويل٫عدد_عائم_طويل٫منطقي٫تسلسل_رموز٫عدد_طويل٫عدد_عائم_طويل٫منطقي٫تسلسل_رموز٫عدد_طويل٫عدد_عائم_طويل٫عدد_عائم_طويل تعيين "قبلي"؛400؛9223372036854775807؛"قبلي"؛400؛9223372036854775807؛"قبلي"؛400؛9223372036854775807؛(٣٢، ٤٥)
								(
								ت٫ش٬ع،ي؛ز,س؛ص٫ه٬ض،ق
								)
								""",
								null,
								newSpecifiedTypesExceedVariableNamesError(1, 0)
							),
					Arguments
							.of(true,
								"""
								متغير ه : عدد_صحيح تعيين 2147483647
								متغير قائمة تعيين [٨٥، ٩٠، ٧٨، ٩٢]
								قائمة[0]؛قائمة[0][0]؛قائمة[0][0][0]؛قائمة[0][0][0][0]؛قائمة[0][0][0][0][0]؛ه = [٨٥، ٩٠، ٧٨، ٩٢] , [٨٥، ٩٠، ٧٨، ٩٢], [٨٥، ٩٠، ٧٨، ٩٢], [٨٥، ٩٠، ٧٨، ٩٢], [٨٥، ٩٠، ٧٨، ٩٢], ه - 1
								(ه , قائمة[0][0][0][0][0])
								""",
								Tuple.of(2147483646, List.of(85, 90, 78, 92)),
								null),
					Arguments
							.of(true,
								"""
								متغير ه : عدد_صحيح تعيين 2147483647
								متغير المدينة تعيين {
								متغير الاسم تعيين "قبلي",
								متغير عدد_السكان تعيين 50000,
								متغير البلدة تعيين {
									متغير الاسم تعيين "سوق الأحد",
									متغير عدد_البيوت تعيين 400
								}
								}

								المدينة:البلدة:عدد_البيوت؛ه = المدينة:البلدة:عدد_البيوت + 50 , ه - 1
								(ه , المدينة:البلدة:عدد_البيوت)
								""",
								Tuple.of(2147483646, 450),
								null),
					Arguments
							.of(true,
								"""
								متغير أ؛ب تعيين (٣٢، ٤٥)
								(أ , ب)
								""",
								Tuple.of(32, 45),
								null),
					Arguments
							.of(false,
								"""
								متغير أ؛ب تعيين ٣٢
								""",
								null,
								newSingleExpressionAssignmentError(1, 0)),
					Arguments
							.of(true,
								"""
								متغير أ؛ب
								أ؛ب تعيين (٣٢، ٤٥)
								(أ , ب)
								""",
								Tuple.of(32, 45),
								null),
					Arguments
							.of(false,
								"""
								متغير أ؛ب
								أ؛ب تعيين ٣٢
								""",
								null,
								newSingleExpressionAssignmentError(2, 0)),
					Arguments
							.of(true,
								"""
								دالة دالة_ترجع_تركيبة() : عدد_طويل {
								ارجع (٣٢، ٤٥)
								}

								متغير أ؛ب تعيين دالة_ترجع_تركيبة()
								(أ , ب)
								""",
								Tuple.of(32, 45),
								null),
					Arguments
							.of(true,
								"""
								دالة دالة_ترجع_تركيبة() : عدد_طويل {
								ارجع ٣٢ ، ٤٥
								}

								متغير أ؛ب تعيين دالة_ترجع_تركيبة()
								(أ , ب)
								""",
								Tuple.of(32, 45),
								null)
				);
	}
}
