package org.daiitech.naftah.parser.provider.script;

import java.util.List;
import java.util.stream.Stream;

import org.daiitech.naftah.builtin.lang.None;
import org.daiitech.naftah.builtin.utils.tuple.Pair;
import org.daiitech.naftah.builtin.utils.tuple.Tuple;
import org.daiitech.naftah.errors.NaftahBugError;
import org.junit.jupiter.api.extension.ExtensionContext;
import org.junit.jupiter.params.provider.Arguments;
import org.junit.jupiter.params.provider.ArgumentsProvider;


public class ConcurrencyProvider implements ArgumentsProvider {
	@Override
	public Stream<? extends Arguments> provideArguments(ExtensionContext context) throws Exception {
		return Stream
				.of(
					Arguments.of(true, """
										--- تشغيل مهمة غير متزامنة للحصول على عنصر من قائمة
										--- إطلاق مهمة
										ثابت شغل تعيين تشغيل دوال:الحزم::حصول_على_عنصر([1 , 2 , 3], 1)
										--- انتظار انتهاء المهمة
										انتظار شغل
										""", 2, null),
					Arguments
							.of(true,
								"""
								--- بداية نطاق مستقل
								نطاق {
								--- إنشاء قائمة جديدة داخل النطاق
								متغير قائمة_ تعيين [1 , 2 , 3]
								--- تعديل العنصر رقم 1 إلى 99
								دوال:الحزم::تعيين_عنصر(قائمة_, 1 , 99)
								--- طباعة/تشغيل القائمة بعد التعديل
								تشغيل قائمة_

								--- إنشاء مجموعة جديدة
								متغير مجموعة_ تعيين {1 , 2}
								--- تعديل العنصر الثاني في المجموعة
								دوال:الحزم::تعيين_عنصر(مجموعة_, 1 , 99)
								--- طباعة المجموعة
								تشغيل مجموعة_

								--- تشغيل دالة الحصول على عنصر من قائمة مؤقتة
								تشغيل دوال:الحزم::حصول_على_عنصر([1 , 2 , 3], 1)
								--- الحصول على عنصر من تركيبة (Tuple)
								دوال:الحزم::حصول_على_عنصر((1 , 2), 1)
								--- الحصول على عنصر من مجموعة
								تشغيل دوال:الحزم::حصول_على_عنصر({1 , 2}, 1)

								--- نطاق متداخل (بدأ التكرار 1)
								نطاق {
								متغير قائمة_ تعيين [1 , 2 , 3]
								دوال:الحزم::تعيين_عنصر(قائمة_, 1 , 99)
								تشغيل قائمة_

								متغير مجموعة_ تعيين {1 , 2}
								دوال:الحزم::تعيين_عنصر(مجموعة_, 1 , 99)
								تشغيل مجموعة_

								تشغيل دوال:الحزم::حصول_على_عنصر([1 , 2 , 3], 1)
								دوال:الحزم::حصول_على_عنصر((1 , 2), 1)
								تشغيل دوال:الحزم::حصول_على_عنصر({1 , 2}, 1)

								--- نطاق متداخل (بدأ التكرار 2)
								نطاق {
								متغير قائمة_ تعيين [1 , 2 , 3]
								دوال:الحزم::تعيين_عنصر(قائمة_, 1 , 99)
								تشغيل قائمة_

								متغير مجموعة_ تعيين {1 , 2}
								دوال:الحزم::تعيين_عنصر(مجموعة_, 1 , 99)
								تشغيل مجموعة_

								تشغيل دوال:الحزم::حصول_على_عنصر([1 , 2 , 3], 1)
								دوال:الحزم::حصول_على_عنصر((1 , 2), 1)
								تشغيل دوال:الحزم::حصول_على_عنصر({1 , 2}, 1)

								--- نطاق متداخل (بدأ التكرار 3)
								نطاق {
								متغير قائمة_ تعيين [1 , 2 , 3]
								دوال:الحزم::تعيين_عنصر(قائمة_, 1 , 99)
								تشغيل قائمة_

								متغير مجموعة_ تعيين {1 , 2}
								دوال:الحزم::تعيين_عنصر(مجموعة_, 1 , 99)
								تشغيل مجموعة_

								تشغيل دوال:الحزم::حصول_على_عنصر([1 , 2 , 3], 1)
								دوال:الحزم::حصول_على_عنصر((1 , 2), 1)
								تشغيل دوال:الحزم::حصول_على_عنصر({1 , 2}, 1)

								--- نطاق متداخل (بدأ التكرار 4)
								نطاق {
								متغير قائمة_ تعيين [1 , 2 , 3]
								دوال:الحزم::تعيين_عنصر(قائمة_, 1 , 99)
								تشغيل قائمة_

								متغير مجموعة_ تعيين {1 , 2}
								دوال:الحزم::تعيين_عنصر(مجموعة_, 1 , 99)
								تشغيل مجموعة_

								تشغيل دوال:الحزم::حصول_على_عنصر([1 , 2 , 3], 1)
								دوال:الحزم::حصول_على_عنصر((1 , 2), 1)
								تشغيل دوال:الحزم::حصول_على_عنصر({1 , 2}, 1)

								--- نطاق متداخل (بدأ التكرار 5)
								نطاق {
								متغير قائمة_ تعيين [1 , 2 , 3]
								دوال:الحزم::تعيين_عنصر(قائمة_, 1 , 99)
								تشغيل قائمة_

								متغير مجموعة_ تعيين {1 , 2}
								دوال:الحزم::تعيين_عنصر(مجموعة_, 1 , 99)
								تشغيل مجموعة_

								تشغيل دوال:الحزم::حصول_على_عنصر([1 , 2 , 3], 1)
								دوال:الحزم::حصول_على_عنصر((1 , 2), 1)
								تشغيل دوال:الحزم::حصول_على_عنصر({1 , 2}, 1)
								}
								}
								}
								}
								}
								}
								""",
								Tuple.of(),
								null),
					Arguments
							.of(true,
								"""
								--- تعريف دالة غير متزامنة تقوم بعملية طويلة
								غير_متزامن دالة مهمة_طويلة_المدى(ثابت بادئة : تسلسل_أحرف ،ثابت نهاية_الحلقة_التكرارية
								= 100000) {
								--- تحضير قائمة لتجميع النتائج
								ثابت قائمة_النتائج تعيين []

								--- حلقة طويلة حسب العدد المطلوب
								كرر_حلقة أ تعيين 0 إلى نهاية_الحلقة_التكرارية إفعل {
								--- تجهيز النص الناتج
								ثابت نتيجة = "{{بادئة}}-{{أ}}"
								--- طباعة النتيجة أثناء التنفيذ
								إطبع(نتيجة)
								--- تخزين النتيجة داخل القائمة
								قائمة_النتائج::إضافة(أ؛نتيجة)
								}
								أنهي

								--- إرجاع كل النتائج عند انتهاء المهمة
								ارجع قائمة_النتائج
								}

								--- انتظار تنفيذ مهمة طويلة (تشغيل ثم انتظار)
								--- تنفيذ الدالة ثم انتظار نتائجها
								انتظار مهمة_طويلة_المدى("مهمة"؛10)
								""",
								List.of(),
								null),
					Arguments
							.of(false,
								"""
								--- تعريف دالة غير متزامنة تقوم بعملية طويلة
								غير_متزامن دالة مهمة_طويلة_المدى(ثابت بادئة : تسلسل_أحرف ،ثابت نهاية_الحلقة_التكرارية
								= 100000) {
								--- تحضير قائمة لتجميع النتائج
								ثابت قائمة_النتائج تعيين []

								--- حلقة طويلة حسب العدد المطلوب
								كرر_حلقة أ تعيين 0 إلى نهاية_الحلقة_التكرارية إفعل {
								--- تجهيز النص الناتج
								ثابت نتيجة = "{{بادئة}}-{{أ}}"
								--- طباعة النتيجة أثناء التنفيذ
								إطبع(نتيجة)
								--- تخزين النتيجة داخل القائمة
								قائمة_النتائج::إضافة(أ؛نتيجة)
								}
								أنهي

								--- إرجاع كل النتائج عند انتهاء المهمة
								ارجع قائمة_النتائج
								}

								--- انتظار تنفيذ مهمة طويلة (تشغيل ثم انتظار)
								--- محاولة تشغيل دالة غير متزامنة (مثال غير صالح)
								ثابت شغل تعيين تشغيل مهمة_طويلة_المدى("مهمة")
								""",
								null,
								new NaftahBugError(
													"""
													الدالة غير المتزامنة (async) '%s' لا يمكن تشغيلها باستخدام أمر '%s'.
													"""
															.formatted(
																		"مهمة_طويلة_المدى",
																		"'انتظار'"),
													24,
													21)),
					Arguments
							.of(true,
								"""
								--- تعريف دالة غير متزامنة تقوم بعملية طويلة
								غير_متزامن دالة مهمة_طويلة_المدى(ثابت بادئة : تسلسل_أحرف ،ثابت نهاية_الحلقة_التكرارية
								= 100000) {
								--- تحضير قائمة لتجميع النتائج
								ثابت قائمة_النتائج تعيين []

								--- حلقة طويلة حسب العدد المطلوب
								كرر_حلقة أ تعيين 0 إلى نهاية_الحلقة_التكرارية إفعل {
								--- تجهيز النص الناتج
								ثابت نتيجة = "{{بادئة}}-{{أ}}"
								--- طباعة النتيجة أثناء التنفيذ
								إطبع(نتيجة)
								--- تخزين النتيجة داخل القائمة
								قائمة_النتائج::إضافة(أ؛نتيجة)
								}
								أنهي

								--- إرجاع كل النتائج عند انتهاء المهمة
								ارجع قائمة_النتائج
								}

								--- تشغيل المهمة بعدد 10 دورات فقط
								ثابت شغل تعيين مهمة_طويلة_المدى("مهمة"؛10)
								--- انتظار انتهاء الشغل
								انتظار شغل
								""",
								List.of(),
								null),
					Arguments
							.of(true,
								"""
								--- تعريف دالة غير متزامنة تقوم بعملية طويلة
								غير_متزامن دالة مهمة_طويلة_المدى(ثابت بادئة : تسلسل_أحرف ،ثابت نهاية_الحلقة_التكرارية
								= 100000) {
								--- تحضير قائمة لتجميع النتائج
								ثابت قائمة_النتائج تعيين []

								--- حلقة طويلة حسب العدد المطلوب
								كرر_حلقة أ تعيين 0 إلى نهاية_الحلقة_التكرارية إفعل {
								--- تجهيز النص الناتج
								ثابت نتيجة = "{{بادئة}}-{{أ}}"
								--- طباعة النتيجة أثناء التنفيذ
								إطبع(نتيجة)
								--- تخزين النتيجة داخل القائمة
								قائمة_النتائج::إضافة(أ؛نتيجة)
								}
								أنهي

								--- إرجاع كل النتائج عند انتهاء المهمة
								ارجع قائمة_النتائج
								}

								--- تشغيل المهمة بعدد 100 دورات فقط
								ثابت شغل تعيين مهمة_طويلة_المدى("مهمة"؛100)
								--- انتظار انتهاء الشغل
								انتظار شغل
								""",
								List.of(),
								null),
					Arguments
							.of(true,
								"""
								--- تعريف دالة غير متزامنة تقوم بعملية طويلة
								غير_متزامن دالة مهمة_طويلة_المدى(ثابت بادئة : تسلسل_أحرف ،ثابت نهاية_الحلقة_التكرارية
								= 100000) {
								--- تحضير قائمة لتجميع النتائج
								ثابت قائمة_النتائج تعيين []

								--- حلقة طويلة حسب العدد المطلوب
								كرر_حلقة أ تعيين 0 إلى نهاية_الحلقة_التكرارية إفعل {
								--- تجهيز النص الناتج
								ثابت نتيجة = "{{بادئة}}-{{أ}}"
								--- طباعة النتيجة أثناء التنفيذ
								إطبع(نتيجة)
								--- تخزين النتيجة داخل القائمة
								قائمة_النتائج::إضافة(أ؛نتيجة)
								}
								أنهي

								--- إرجاع كل النتائج عند انتهاء المهمة
								ارجع قائمة_النتائج
								}

								--- ضرب نتيجة غير متزامنة (async) في نتيجة غير متزامنة (async) أخرى
								ثابت نتيجة_شغل تعيين انتظار مهمة_طويلة_المدى("مهمة"؛10) * (انتظار تشغيل
								دوال:الحزم::حصول_على_عنصر([1 , 2 , 3], 1))

								نتيجة_شغل
								""",
								List.of(),
								null),
					Arguments
							.of(true,
								"""
								--- تعريف دالة غير متزامنة تقوم بعملية طويلة
								غير_متزامن دالة مهمة_طويلة_المدى(ثابت بادئة : تسلسل_أحرف ،ثابت نهاية_الحلقة_التكرارية
								= 100000) {
								--- تحضير قائمة لتجميع النتائج
								ثابت قائمة_النتائج تعيين []

								--- حلقة طويلة حسب العدد المطلوب
								كرر_حلقة أ تعيين 0 إلى نهاية_الحلقة_التكرارية إفعل {
								--- تجهيز النص الناتج
								ثابت نتيجة = "{{بادئة}}-{{أ}}"
								--- طباعة النتيجة أثناء التنفيذ
								إطبع(نتيجة)
								--- تخزين النتيجة داخل القائمة
								قائمة_النتائج::إضافة(أ؛نتيجة)
								}
								أنهي

								--- إرجاع كل النتائج عند انتهاء المهمة
								ارجع قائمة_النتائج
								}

								--- ضرب نتيجة المهمة بقيمة ثابتة
								ثابت نتيجة_شغل تعيين انتظار مهمة_طويلة_المدى("مهمة"؛10) * 10

								نتيجة_شغل
								""",
								List.of(),
								null),
					Arguments
							.of(true,
								"""
								--- تعريف دالة غير متزامنة تقوم بعملية طويلة
								غير_متزامن دالة مهمة_طويلة_المدى(ثابت بادئة : تسلسل_أحرف ،ثابت نهاية_الحلقة_التكرارية
								= 100000) {
								--- تحضير قائمة لتجميع النتائج
								ثابت قائمة_النتائج تعيين []

								--- حلقة طويلة حسب العدد المطلوب
								كرر_حلقة أ تعيين 0 إلى نهاية_الحلقة_التكرارية إفعل {
								--- تجهيز النص الناتج
								ثابت نتيجة = "{{بادئة}}-{{أ}}"
								--- طباعة النتيجة أثناء التنفيذ
								إطبع(نتيجة)
								--- تخزين النتيجة داخل القائمة
								قائمة_النتائج::إضافة(أ؛نتيجة)
								}
								أنهي

								--- إرجاع كل النتائج عند انتهاء المهمة
								ارجع قائمة_النتائج
								}

								---*
								تنفيذ عدة مهام طويلة داخل نطاقات مختلفة
								*---
								نطاق {
								مهمة_طويلة_المدى("مهمة-1"؛2)
								مهمة_طويلة_المدى("مهمة-2"؛1)
								مهمة_طويلة_المدى("مهمة-3"؛15)
								مهمة_طويلة_المدى("مهمة-4"؛1)
								مهمة_طويلة_المدى("مهمة-5"؛5)
								مهمة_طويلة_المدى("مهمة-6"؛5)
								مهمة_طويلة_المدى("مهمة-7"؛1)
								مهمة_طويلة_المدى("مهمة-8"؛5)
								مهمة_طويلة_المدى("مهمة-9"؛1)
								مهمة_طويلة_المدى("مهمة-10"؛10)
								}
								""",
								Tuple.of(),
								null),
					Arguments
							.of(true,
								"""
								--- تعريف دالة غير متزامنة تقوم بعملية طويلة
								غير_متزامن دالة مهمة_طويلة_المدى(ثابت بادئة : تسلسل_أحرف ،ثابت نهاية_الحلقة_التكرارية
								= 100000) {
								--- تحضير قائمة لتجميع النتائج
								ثابت قائمة_النتائج تعيين []

								--- حلقة طويلة حسب العدد المطلوب
								كرر_حلقة أ تعيين 0 إلى نهاية_الحلقة_التكرارية إفعل {
								--- تجهيز النص الناتج
								ثابت نتيجة = "{{بادئة}}-{{أ}}"
								--- طباعة النتيجة أثناء التنفيذ
								إطبع(نتيجة)
								--- تخزين النتيجة داخل القائمة
								قائمة_النتائج::إضافة(أ؛نتيجة)
								}
								أنهي

								--- إرجاع كل النتائج عند انتهاء المهمة
								ارجع قائمة_النتائج
								}

								---*
								تنفيذ نفس المهام داخل نطاق مرتب
								أي أن التنفيذ يتم بترتيب محدد أو دفعات مرتبة (الأول بالأول)
								*---
								نطاق مرتب {
								مهمة_طويلة_المدى("مهمة-1"؛2)
								مهمة_طويلة_المدى("مهمة-2"؛1)
								مهمة_طويلة_المدى("مهمة-3"؛1)
								مهمة_طويلة_المدى("مهمة-4"؛5)
								مهمة_طويلة_المدى("مهمة-5"؛5)
								مهمة_طويلة_المدى("مهمة-6"؛2)
								مهمة_طويلة_المدى("مهمة-7"؛1)
								مهمة_طويلة_المدى("مهمة-8"؛2)
								مهمة_طويلة_المدى("مهمة-9"؛1)
								مهمة_طويلة_المدى("مهمة-10"؛10)
								}
								""",
								Tuple.of(),
								null),
					Arguments
							.of(true,
								"""
								--- إنشاء قناة مشتركة لنقل الرسائل بين المنتج والمستهلك
								قناة قناة_مشتركة

								--- ممثل بسيط يقوم فقط بطباعة الرسائل المستلمة
								ممثل طابعة(رسالة_الطابعة){
								إطبع(رسالة_الطابعة) --- طباعة الرسالة مباشرة
								}

								--- دالة غير متزامنة تقوم بإرسال عدد كبير من الرسائل عبر القناة
								غير_متزامن دالة منتج(ثابت قناة_ ، ثابت نهاية_الحلقة_التكرارية = 100000) {
								--- حلقة إرسال الرسائل
								كرر_حلقة أ تعيين 0 إلى نهاية_الحلقة_التكرارية إفعل {
								قناة_::إرسال("منتج أرسل رسالة عدد {{أ}}") --- إرسال رسالة عبر القناة
								}
								أنهي
								}

								--- المستهلك يستقبل رسالة من القناة ويعطيها للممثل لمعالجتها
								دالة مستهلك(ثابت قناة_ ، ثابت طابعة ، ثابت نهاية_الحلقة_التكرارية = 100000) {
								كرر_حلقة أ تعيين 0 إلى نهاية_الحلقة_التكرارية إفعل {
									ثابت رسالة = قناة_::الاستلام() --- استقبال رسالة من القناة
									طابعة::إرسال(رسالة) --- إرسال الرسالة إلى الممثل لمعالجتها
								}
								أنهي
								}

								--- تشغيل المنتج والمستهلك معًا
								نطاق {
								منتج(قناة_مشتركة؛10)  --- تشغيل المنتج وإرسال 10 رسائل
								تشغيل مستهلك(قناة_مشتركة؛طابعة؛10) --- تشغيل المستهلك بشكل متزامن لمعالجة 10 رسائل
								}
								""",
								Pair.of(None.get(), true),
								null),
					Arguments
							.of(true,
								"""
								--- إنشاء قناة مشتركة لنقل الرسائل بين المنتج والمستهلك
								قناة قناة_مشتركة

								--- ممثل آخر باسم طابعة و اسم متغير الرسالة الأصلي "رسالة_الممثل"
								ممثل طابعة {
								إطبع(رسالة_الممثل)  --- يطبع رسالة بإستعمال اسم متغير الرسالة الأصلي
								}

								--- دالة غير متزامنة تقوم بإرسال عدد كبير من الرسائل عبر القناة
								غير_متزامن دالة منتج(ثابت قناة_ ، ثابت نهاية_الحلقة_التكرارية = 100000) {
								--- حلقة إرسال الرسائل
								كرر_حلقة أ تعيين 0 إلى نهاية_الحلقة_التكرارية إفعل {
								قناة_::إرسال("منتج أرسل رسالة عدد {{أ}}") --- إرسال رسالة عبر القناة
								}
								أنهي
								}

								--- المستهلك يستقبل رسالة من القناة ويعطيها للممثل لمعالجتها
								دالة مستهلك(ثابت قناة_ ، ثابت طابعة ، ثابت نهاية_الحلقة_التكرارية = 100000) {
								كرر_حلقة أ تعيين 0 إلى نهاية_الحلقة_التكرارية إفعل {
									ثابت رسالة = قناة_::الاستلام() --- استقبال رسالة من القناة
									طابعة::إرسال(رسالة) --- إرسال الرسالة إلى الممثل لمعالجتها
								}
								أنهي
								}

								--- تشغيل المنتج والمستهلك معًا
								نطاق {
								منتج(قناة_مشتركة؛10)  --- تشغيل المنتج وإرسال 10 رسائل
								تشغيل مستهلك(قناة_مشتركة؛طابعة؛10) --- تشغيل المستهلك بشكل متزامن لمعالجة 10 رسائل
								}
								""",
								Pair.of(None.get(), true),
								null),
					Arguments
							.of(true,
								"""
								--- إنشاء قناة مشتركة لنقل الرسائل بين المنتج والمستهلك
								قناة قناة_مشتركة

								--- ممثل بطابعة مع بيانات أولية
								ممثل طابعة(رسالة_الطابعة, --- اسم متغير الرسالة
								(
								متغير الاسم تعيين "طابعة" --- خاصية: اسم الممثل
								)
								){
								إطبع("{{الاسم}} : {{رسالة_الطابعة}}") --- طباعة مع تضمين الاسم والرسالة
								}

								--- دالة غير متزامنة تقوم بإرسال عدد كبير من الرسائل عبر القناة
								غير_متزامن دالة منتج(ثابت قناة_ ، ثابت نهاية_الحلقة_التكرارية = 100000) {
								--- حلقة إرسال الرسائل
								كرر_حلقة أ تعيين 0 إلى نهاية_الحلقة_التكرارية إفعل {
								قناة_::إرسال("منتج أرسل رسالة عدد {{أ}}") --- إرسال رسالة عبر القناة
								}
								أنهي
								}

								--- المستهلك يستقبل رسالة من القناة ويعطيها للممثل لمعالجتها
								دالة مستهلك(ثابت قناة_ ، ثابت طابعة ، ثابت نهاية_الحلقة_التكرارية = 100000) {
								كرر_حلقة أ تعيين 0 إلى نهاية_الحلقة_التكرارية إفعل {
									ثابت رسالة = قناة_::الاستلام() --- استقبال رسالة من القناة
									طابعة::إرسال(رسالة) --- إرسال الرسالة إلى الممثل لمعالجتها
								}
								أنهي
								}

								--- تشغيل المنتج والمستهلك معًا
								نطاق {
								منتج(قناة_مشتركة؛10)  --- تشغيل المنتج وإرسال 10 رسائل
								تشغيل مستهلك(قناة_مشتركة؛طابعة؛10) --- تشغيل المستهلك بشكل متزامن لمعالجة 10 رسائل
								}
								""",
								Pair.of(None.get(), true),
								null),
					Arguments
							.of(true,
								"""
								--- إنشاء قناة مشتركة لنقل الرسائل بين المنتج والمستهلك
								قناة قناة_مشتركة

								--- ممثل بطابعة يحتوي حقولًا إضافية ويعدّ عدد الرسائل
								ممثل طابعة(
								(
								متغير الاسم تعيين "طابعة", --- اسم الممثل
								متغير عدد_الرسائل تعيين 0 --- عداد الرسائل
								)
								){
								عدد_الرسائل++  --- زيادة عدّاد المستلم
								إطبع("اسم الممثل: {{الاسم}} - رسالة عدد: {{عدد_الرسائل}} - الرسالة: {{رسالة_الممثل}}") --- طباعة مفصلة للرسالة
								}

								--- دالة غير متزامنة تقوم بإرسال عدد كبير من الرسائل عبر القناة
								غير_متزامن دالة منتج(ثابت قناة_ ، ثابت نهاية_الحلقة_التكرارية = 100000) {
								--- حلقة إرسال الرسائل
								كرر_حلقة أ تعيين 0 إلى نهاية_الحلقة_التكرارية إفعل {
								قناة_::إرسال("منتج أرسل رسالة عدد {{أ}}") --- إرسال رسالة عبر القناة
								}
								أنهي
								}

								--- المستهلك يستقبل رسالة من القناة ويعطيها للممثل لمعالجتها
								دالة مستهلك(ثابت قناة_ ، ثابت طابعة ، ثابت نهاية_الحلقة_التكرارية = 100000) {
								كرر_حلقة أ تعيين 0 إلى نهاية_الحلقة_التكرارية إفعل {
									ثابت رسالة = قناة_::الاستلام() --- استقبال رسالة من القناة
									طابعة::إرسال(رسالة) --- إرسال الرسالة إلى الممثل لمعالجتها
								}
								أنهي
								}

								--- تشغيل المنتج والمستهلك معًا
								نطاق {
								منتج(قناة_مشتركة؛10)  --- تشغيل المنتج وإرسال 10 رسائل
								تشغيل مستهلك(قناة_مشتركة؛طابعة؛10) --- تشغيل المستهلك بشكل متزامن لمعالجة 10 رسائل
								}
								""",
								Pair.of(None.get(), true),
								null)
				);
	}
}
