package org.daiitech.naftah.parser.provider.script;

import java.math.BigDecimal;
import java.math.BigInteger;
import java.util.HashMap;
import java.util.List;
import java.util.Map;
import java.util.stream.Stream;

import org.daiitech.naftah.NaftahSystem;
import org.daiitech.naftah.builtin.lang.DynamicNumber;
import org.daiitech.naftah.builtin.lang.NaftahObject;
import org.daiitech.naftah.builtin.lang.None;
import org.daiitech.naftah.builtin.utils.tuple.Pair;
import org.daiitech.naftah.builtin.utils.tuple.Triple;
import org.daiitech.naftah.errors.NaftahBugError;
import org.junit.jupiter.api.extension.ExtensionContext;
import org.junit.jupiter.params.provider.Arguments;
import org.junit.jupiter.params.provider.ArgumentsProvider;

import static org.daiitech.naftah.builtin.functions.CollectionBuiltinFunctions.newNaftahNotCollectionOrMapArgumentError;
import static org.daiitech.naftah.errors.ExceptionUtils.newNaftahBugUnsupportedBitwiseDecimalError;
import static org.daiitech.naftah.errors.ExceptionUtils.newNaftahInvocableNotFoundError;
import static org.daiitech.naftah.utils.OS.OS_NAME_PROPERTY;


public class FunctionCallProvider implements ArgumentsProvider {
	@Override
	public Stream<? extends Arguments> provideArguments(ExtensionContext context) throws Exception {
		return Stream
				.of(
					Arguments.of(true, "إطبع(\"مرحباً أيها العالم!\")", None.get(), null),
					Arguments.of(true, "ڨول(\"مرحباً أيها العالم!\")", None.get(), null),
					Arguments.of(true, "قول(\"مرحباً أيها العالم!\")", None.get(), null),
					Arguments.of(true, "قل(\"مرحباً أيها العالم!\")", None.get(), null),
					Arguments.of(true, "ڨلي(\"مرحباً أيها العالم!\")", None.get(), null),
					Arguments.of(true, "ڨلّي(\"مرحباً أيها العالم!\")", None.get(), null),
					Arguments.of(true, "قلي(\"مرحباً أيها العالم!\")", None.get(), null),
					Arguments.of(true, "قلّي(\"مرحباً أيها العالم!\")", None.get(), null),
					Arguments.of(true, "إكتب(\"مرحباً أيها العالم!\")", None.get(), null),
					Arguments.of(true, "إجمع(127 ، 1)", 128, null),
					Arguments.of(true, "إجمع(32767 ، 1)", 32768, null),
					Arguments.of(true, "إجمع(2147483647 ، 1)", 2147483648L, null),
					Arguments
							.of(true,
								"إجمع(9223372036854775807 ، 1)",
								new BigInteger("9223372036854775808"),
								null),
					Arguments
							.of(true,
								"إجمع(340282346638528859811704183484516925440,000000 ، 1)",
								new BigDecimal("340282346638528859811704183484516925441.000000"),
								null),
					Arguments
							.of(true,
								"إجمع(179769313486231570000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000,000000 ، 1)",
								new BigDecimal(
												"179769313486231570000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000001.000000"),
								null),
					Arguments.of(true, "إطرح(32768 ، 1)", 32767, null),
					Arguments.of(true, "إطرح(2147483648 ، 1)", 2147483647, null),
					Arguments.of(true, "إطرح(9223372036854775808 ، 1)", 9223372036854775807L, null),
					Arguments
							.of(true,
								"إطرح(340282346638528859811704183484516925441,000000 ، 1)",
								new BigInteger("340282346638528859811704183484516925440"),
								null),
					Arguments
							.of(true,
								"إطرح(179769313486231570000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000001,000000 ، 1)",
								new BigDecimal(
												"179769313486231570000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000.000000"),
								null),
					Arguments.of(true, "إضرب(127 ، 2)", 254, null),
					Arguments.of(true, "إضرب(32767 ، 2)", 65534, null),
					Arguments.of(true, "إضرب(2147483647 ، 2)", 4294967294L, null),
					Arguments
							.of(true,
								"إضرب(9223372036854775807 ، 2)",
								new BigInteger("18446744073709551614"),
								null),
					Arguments
							.of(true,
								"إضرب(340282346638528859811704183484516925440,000000 ، 2)",
								new BigDecimal("680564693277057719623408366969033850880"),
								null),
					Arguments
							.of(true,
								"إضرب(179769313486231570000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000001,000000 ، 2)",
								new BigDecimal(
												"359538626972463140000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000002.000000"),
								null),
					Arguments
							.of(false,
								"إقسم(127 ، 0)",
								null,
								new NaftahBugError(new ArithmeticException("/ by zero"))),
					Arguments.of(true, "إقسم(254 ، 2)", 127, null),
					Arguments.of(true, "إقسم(65534 ، 2)", 32767, null),
					Arguments.of(true, "إقسم(4294967294 ، 2)", 2147483647, null),
					Arguments.of(true, "إقسم(18446744073709551614 ، 2)", 9223372036854775807L, null),
					Arguments
							.of(true,
								"إقسم(680564693277057719623408366969033850880,000000 ، 2)",
								new BigDecimal("340282346638528859811704183484516925440.000000"),
								null),
					Arguments
							.of(true,
								"إقسم(179769313486231570000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000001,000000 ، 2)",
								new BigDecimal(
												"89884656743115785000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000.500000"),
								null),
					Arguments
							.of(false,
								"باقي_القسمة(127 ، 0)",
								null,
								new NaftahBugError(new ArithmeticException("/ by zero"))),
					Arguments.of(true, "باقي_القسمة(254 ، 2)", 0, null),
					Arguments.of(true, "باقي_القسمة(65534 ، 2)", 0, null),
					Arguments.of(true, "باقي_القسمة(4294967294 ، 2)", 0, null),
					Arguments.of(true, "باقي_القسمة(18446744073709551614 ، 2)", 0, null),
					Arguments
							.of(true, "باقي_القسمة(680564693277057719623408366969033850880,000000 ، 2)", 0, null),
					Arguments
							.of(true,
								"""
								باقي_القسمة(179769313486231570000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000001,000000 ، 2)""",
								1.0,
								null),
					Arguments.of(true, "الأكبر(1 ، 2)", 2, null),
					Arguments.of(true, "الأكبر(2 ، 1)", 2, null),
					Arguments.of(true, "الأكبر(-1 ، 2)", 2, null),
					Arguments.of(true, "الأكبر(1 ، -2)", 1, null),
					Arguments.of(true, "الأصغر(1 ، 2)", 1, null),
					Arguments.of(true, "الأصغر(2 ، 1)", 1, null),
					Arguments.of(true, "الأصغر(-1 ، 2)", -1, null),
					Arguments.of(true, "الأصغر(1 ، -2)", -2, null),
					Arguments.of(true, "إرفع(6 ، 3)", 216, null),
					Arguments.of(true, "إرفع(200 ، 2)", 40000, null),
					Arguments.of(true, "إرفع(50000 ، 2)", 2500000000L, null),
					Arguments.of(true, "إرفع(10000000 ، 3)", new BigInteger("1000000000000000000000"), null),
					Arguments.of(true, "إرفع(10،0 ، 18)", 1000000000000000000.0, null),
					Arguments
							.of(true,
								"إرفع(10،0 ، 309)",
								new BigDecimal(
												"1000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000"),
								null),
					Arguments.of(true, "تقريب(2،5)", 3, null),
					Arguments.of(true, "تقريب(2،3)", 2, null),
					Arguments.of(true, "تقريب(2،0)", 2, null),
					Arguments.of(true, "تقريب(-2،5)", -2, null),
					Arguments.of(true, "تقريب(-2،3)", -2, null),
					Arguments.of(true, "تقريب(-2،0)", -2, null),
					Arguments.of(true, "تقريب(-2،7)", -3, null),
					Arguments.of(true, "أرضي(3،7)", 3.0, null),
					Arguments.of(true, "أرضي(3،0)", 3.0, null),
					Arguments.of(true, "أرضي(-3،7)", -4.0, null),
					Arguments.of(true, "أرضي(-3،0)", -3.0, null),
					Arguments.of(true, "سقف(3،7)", 4.0, null),
					Arguments.of(true, "سقف(3،0)", 3.0, null),
					Arguments.of(true, "سقف(-3،7)", -3.0, null),
					Arguments.of(true, "سقف(-3،0)", -3.0, null),
					Arguments.of(true, "إنفي(-127)", 127, null),
					Arguments.of(true, "إنفي(-32767)", 32767, null),
					Arguments.of(true, "إنفي(-2147483647)", 2147483647, null),
					Arguments.of(true, "إنفي(-9223372036854775807)", 9223372036854775807L, null),
					Arguments
							.of(true,
								"إنفي(-340282346638528859811704183484516925440,000000)",
								new BigDecimal("340282346638528859811704183484516925440.000000"),
								null),
					Arguments
							.of(true,
								"إنفي(-179769313486231570000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000,000000)",
								new BigDecimal(
												"179769313486231570000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000.000000"),
								null),
					Arguments.of(true, "جذر(127)", 11.269427669584644, null),
					Arguments.of(true, "جذر(32767)", 181.01657382681842, null),
					Arguments.of(true, "جذر(2147483647)", 46340.950001051984, null),
					Arguments.of(true, "جذر(9223372036854775807)", 3037000499.976049900054931640625, null),
					Arguments
							.of(true,
								"جذر(340282346638528859811704183484516925440,000000)",
								new BigDecimal("18446743523953729535.99975585936591"),
								null),
					Arguments
							.of(true,
								"جذر(179769313486231570000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000,000000)",
								13407807929942596324916056014015670000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000.0,
								null),
					Arguments.of(true, "القيمة_المطلقة(2)", 2, null),
					Arguments.of(true, "القيمة_المطلقة(-2)", 2, null),
					Arguments.of(true, "القيمة_المطلقة(2،0)", 2.0, null),
					Arguments.of(true, "القيمة_المطلقة(-2،0)", 2.0, null),
					Arguments.of(true, "إشارة(2)", 1, null),
					Arguments.of(true, "إشارة(0)", 0, null),
					Arguments.of(true, "إشارة(-2)", -1, null),
					Arguments.of(true, "إشارة(2،0)", 1, null),
					Arguments.of(true, "إشارة(0،0)", 0, null),
					Arguments.of(true, "إشارة(-2،0)", -1, null),
					Arguments.of(true, "هل_صفر(2)", false, null),
					Arguments.of(true, "هل_صفر(0)", true, null),
					Arguments.of(true, "هل_صفر(-2)", false, null),
					Arguments.of(true, "هل_صفر(2،0)", false, null),
					Arguments.of(true, "هل_صفر(0،0)", true, null),
					Arguments.of(true, "هل_صفر(-2،0)", false, null),
					Arguments.of(true, "هل_يساوي(2 ، 2)", true, null),
					Arguments.of(true, "هل_يساوي(فارغ ، 2)", false, null),
					Arguments.of(true, "هل_يساوي(2 ، فارغ)", false, null),
					Arguments.of(true, "هل_يساوي(-2 ، 2)", false, null),
					Arguments.of(true, "هل_يساوي(2 ، -2)", false, null),
					Arguments.of(true, "هل_يساوي(1 ، 2)", false, null),
					Arguments.of(true, "هل_لا_يساوي(فارغ ، 2)", true, null),
					Arguments.of(true, "هل_لا_يساوي(2 ، فارغ)", true, null),
					Arguments.of(true, "هل_لا_يساوي(2 ، 2)", false, null),
					Arguments.of(true, "هل_لا_يساوي(-2 ، 2)", true, null),
					Arguments.of(true, "هل_لا_يساوي(2 ، -2)", true, null),
					Arguments.of(true, "هل_لا_يساوي(1 ، 2)", true, null),
					Arguments.of(true, "هل_أصغر_من(1 ، 2)", true, null),
					Arguments.of(true, "هل_أصغر_من(2 ، 1)", false, null),
					Arguments.of(true, "هل_أصغر_من(2 ، -2)", false, null),
					Arguments.of(true, "هل_أصغر_من(-2 ، 2)", true, null),
					Arguments.of(true, "هل_أصغر_من(2 ، 2)", false, null),
					Arguments.of(true, "هل_أصغر_أو_يساوي(1 ، 2)", true, null),
					Arguments.of(true, "هل_أصغر_أو_يساوي(2 ، 1)", false, null),
					Arguments.of(true, "هل_أصغر_أو_يساوي(2 ، -2)", false, null),
					Arguments.of(true, "هل_أصغر_أو_يساوي(-2 ، 2)", true, null),
					Arguments.of(true, "هل_أصغر_أو_يساوي(2 ، 2)", true, null),
					Arguments.of(true, "هل_أكبر_من(1 ، 2)", false, null),
					Arguments.of(true, "هل_أكبر_من(2 ، 1)", true, null),
					Arguments.of(true, "هل_أكبر_من(2 ، -2)", true, null),
					Arguments.of(true, "هل_أكبر_من(-2 ، 2)", false, null),
					Arguments.of(true, "هل_أكبر_من(2 ، 2)", false, null),
					Arguments.of(true, "هل_أكبر_أو_يساوي(1 ، 2)", false, null),
					Arguments.of(true, "هل_أكبر_أو_يساوي(2 ، 1)", true, null),
					Arguments.of(true, "هل_أكبر_أو_يساوي(2 ، -2)", true, null),
					Arguments.of(true, "هل_أكبر_أو_يساوي(-2 ، 2)", false, null),
					Arguments.of(true, "هل_أكبر_أو_يساوي(2 ، 2)", true, null),
					Arguments.of(true, "و_بتي(6 ، 3)", 2, null),
					Arguments.of(true, "و_بتي(0 ، 2)", 0, null),
					Arguments.of(true, "و_بتي(خاطئ ، خاطئ)", false, null),
					Arguments.of(true, "و_بتي(خاطئ ، صحيح)", false, null),
					Arguments.of(true, "و_بتي(صحيح ، صحيح)", true, null),
					Arguments.of(true, "أو_بتي(6 ، 3)", 7, null),
					Arguments.of(true, "أو_بتي(0 ، 2)", 2, null),
					Arguments.of(true, "أو_بتي(خاطئ ، خاطئ)", false, null),
					Arguments.of(true, "أو_بتي(خاطئ ، صحيح)", true, null),
					Arguments.of(true, "أو_بتي(صحيح ، صحيح)", true, null),
					Arguments.of(true, "حصري_أو_بتي(6 ، 3)", 5, null),
					Arguments.of(true, "حصري_أو_بتي(0 ، 2)", 2, null),
					Arguments.of(true, "حصري_أو_بتي(خاطئ ، خاطئ)", false, null),
					Arguments.of(true, "حصري_أو_بتي(خاطئ ، صحيح)", true, null),
					Arguments.of(true, "حصري_أو_بتي(صحيح ، صحيح)", false, null),
					Arguments.of(true, "ليس_بتي(6)", -7, null),
					Arguments.of(true, "ليس_بتي(خاطئ)", true, null),
					Arguments.of(true, "ليس_بتي(صحيح)", false, null),
					Arguments.of(true, "ليس_بتي(3)", -4, null),
					Arguments.of(true, "إزاحة_إلى_اليسار(64 ، 2)", 256, null),
					Arguments.of(true, "إزاحة_إلى_اليسار(1073741824 ، 2)", 4294967296L, null),
					Arguments
							.of(true,
								"إزاحة_إلى_اليسار(4611686018427387904 ، 2)",
								new BigInteger("18446744073709551616"),
								null),
					Arguments
							.of(true,
								"إزاحة_إلى_اليسار(1 ، 100)",
								new BigInteger("1267650600228229401496703205376"),
								null),
					Arguments
							.of(false,
								"إزاحة_إلى_اليسار(340282346638528859811704183484516925440,000000 ، 2)",
								null,
								newNaftahBugUnsupportedBitwiseDecimalError( true,
																			DynamicNumber
																					.of(
																						"340282346638528859811704183484516925440.000000"))
							),
					Arguments
							.of(false,
								"""
								إزاحة_إلى_اليسار(179769313486231570000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000,000000 ، 2)""",
								null,
								newNaftahBugUnsupportedBitwiseDecimalError( true,
																			DynamicNumber
																					.of(
																						"179769313486231570000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000,000000"))),
					Arguments.of(true, "إزاحة_إلى_اليمين(128 ، 2)", 32, null),
					Arguments.of(true, "إزاحة_إلى_اليمين(32768 ، 2)", 8192, null),
					Arguments.of(true, "إزاحة_إلى_اليمين(2147483648 ، 2)", 536870912, null),
					Arguments.of(true, "إزاحة_إلى_اليمين(9223372036854775808 ، 2)", 2305843009213693952L, null),
					Arguments
							.of(false,
								"إزاحة_إلى_اليمين(340282346638528859811704183484516925441,000000 ، 2)",
								null,
								newNaftahBugUnsupportedBitwiseDecimalError( true,
																			DynamicNumber
																					.of(
																						"340282346638528859811704183484516925441.000000"))),
					Arguments

							.of(false,
								"""
								إزاحة_إلى_اليمين(179769313486231570000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000001,000000 ، 2)""",
								null,
								newNaftahBugUnsupportedBitwiseDecimalError( true,
																			DynamicNumber
																					.of(
																						"179769313486231570000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000001,000000"))),
					Arguments.of(true, "إزاحة_إلى_اليمين_غير_موقعة(128 ، 2)", 32, null),
					Arguments.of(true, "إزاحة_إلى_اليمين_غير_موقعة(32768 ، 2)", 8192, null),
					Arguments.of(true, "إزاحة_إلى_اليمين_غير_موقعة(2147483648 ، 2)", 536870912, null),
					Arguments
							.of(true,
								"إزاحة_إلى_اليمين_غير_موقعة(9223372036854775808 ، 2)",
								2305843009213693952L,
								null),
					Arguments
							.of(false,
								"إزاحة_إلى_اليمين_غير_موقعة(340282346638528859811704183484516925441,000000 ، 2)",
								null,
								newNaftahBugUnsupportedBitwiseDecimalError( true,
																			DynamicNumber
																					.of(
																						"340282346638528859811704183484516925441.000000"))),
					Arguments
							.of(false,
								"""
								إزاحة_إلى_اليمين_غير_موقعة(179769313486231570000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000001,000000 ، 2)""",
								null,
								newNaftahBugUnsupportedBitwiseDecimalError( true,
																			DynamicNumber
																					.of(
																						"179769313486231570000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000001,000000"))),
					Arguments.of(true, "زيادة_قبلية(127)", 128, null),
					Arguments.of(true, "زيادة_قبلية(32767)", 32768, null),
					Arguments.of(true, "زيادة_قبلية(2147483647)", 2147483648L, null),
					Arguments
							.of(true,
								"زيادة_قبلية(9223372036854775807)",
								new BigInteger("9223372036854775808"),
								null),
					Arguments
							.of(true,
								"زيادة_قبلية(340282346638528859811704183484516925440,000000)",
								new BigDecimal("340282346638528859811704183484516925441.000000"),
								null),
					Arguments
							.of(true,
								"""
								زيادة_قبلية(179769313486231570000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000,000000)""",
								new BigDecimal(
												"179769313486231570000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000001.000000"),
								null),
					Arguments.of(true, "زيادة_بعدية(127)", 127, null),
					Arguments.of(true, "زيادة_بعدية(32767)", 32767, null),
					Arguments.of(true, "زيادة_بعدية(2147483647)", 2147483647, null),
					Arguments.of(true, "زيادة_بعدية(9223372036854775807)", 9223372036854775807L, null),
					Arguments
							.of(true,
								"زيادة_بعدية(340282346638528859811704183484516925440,000000)",
								new BigDecimal("340282346638528859811704183484516925440.000000"),
								null),
					Arguments
							.of(true,
								"""
								زيادة_بعدية(179769313486231570000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000,000000)""",
								new BigDecimal(
												"179769313486231570000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000.000000"),
								null),
					Arguments.of(true, "نقصان_قبلي(128)", 127, null),
					Arguments.of(true, "نقصان_قبلي(32768)", 32767, null),
					Arguments.of(true, "نقصان_قبلي(2147483648)", 2147483647, null),
					Arguments.of(true, "نقصان_قبلي(9223372036854775808)", 9223372036854775807L, null),
					Arguments
							.of(true,
								"نقصان_قبلي(340282346638528859811704183484516925440,000000)",
								new BigDecimal("340282346638528859811704183484516925439.000000"),
								null),
					Arguments
							.of(true,
								"""
								نقصان_قبلي(179769313486231570000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000001,000000)""",
								new BigDecimal(
												"179769313486231570000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000.000000"),
								null),
					Arguments.of(true, "نقصان_بعدي(127)", 127, null),
					Arguments.of(true, "نقصان_بعدي(32767)", 32767, null),
					Arguments.of(true, "نقصان_بعدي(2147483647)", 2147483647, null),
					Arguments.of(true, "نقصان_بعدي(9223372036854775807)", 9223372036854775807L, null),
					Arguments
							.of(true,
								"نقصان_بعدي(340282346638528859811704183484516925440,000000)",
								new BigDecimal("340282346638528859811704183484516925440.000000"),
								null),
					Arguments
							.of(true,
								"""
								نقصان_بعدي(179769313486231570000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000,000000)""",
								new BigDecimal(
												"179769313486231570000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000.000000"),
								null),
					Arguments.of(true, """
										تحليل_رقم_بنظام_العد("1000000000000000"؛2)
										""", 32768, null),
					Arguments.of(   true, """
											تحليل_رقم_بنظام_العد("2000000000000000"؛3)
											"""


									, 28697814, null),
					Arguments.of(   true, """
											تحليل_رقم_بنظام_العد("3000000000000000"؛4)
											"""

									, 3221225472L, null),
					Arguments.of(   true, """
											تحليل_رقم_بنظام_العد("4000000000000000"؛5)
											"""


									, 122070312500L, null),
					Arguments.of(   true, """
											تحليل_رقم_بنظام_العد("5000000000000000"؛6)
											"""

									, 2350924922880L, null),
					Arguments.of(   true, """
											تحليل_رقم_بنظام_العد("6000000000000000"؛7)
											"""


									, 28485369059658L, null),
					Arguments.of(   true, """
											تحليل_رقم_بنظام_العد("7000000000000000"؛8)
											"""

									, 246290604621824L, null),
					Arguments.of(   true, """
											تحليل_رقم_بنظام_العد("8000000000000000"؛9)
											"""

									, 1647129056757192L, null),
					Arguments.of(   true, """
											تحليل_رقم_بنظام_العد("9000000000000000"؛10)
											"""

									, 9000000000000000L, null),
					Arguments.of(   true, """
											تحليل_رقم_بنظام_العد("ا٠٠٠٠٠٠٠٠٠٠٠٠٠٠٠٠"؛١١)
											"""

									, 459497298635721610L, null),
					Arguments.of(   true, """
											تحليل_رقم_بنظام_العد("ب٠٠٠٠٠٠٠٠٠٠٠٠٠٠٠٠"؛١٢)
											"""

									, 2033726847845400576L, null),
					Arguments.of(   true, """
											تحليل_رقم_بنظام_العد("ت٠٠٠٠٠٠٠٠٠٠٠٠٠٠٠٠"؛١٣)
											"""

									, 7984999310198158092L, null),
					Arguments.of(   true, """
											تحليل_رقم_بنظام_العد("ث٠٠٠٠٠٠٠٠٠٠٠٠٠٠٠٠"؛١٤)
											"""


									,
									new BigInteger("28313393391521824768"),
									null),
					Arguments.of(   true, """
											تحليل_رقم_بنظام_العد("ج٠٠٠٠٠٠٠٠٠٠٠٠٠٠٠٠"؛١٥)
											"""


									,
									new BigInteger("91957716979980468750"),
									null),
					Arguments.of(   true, """
											تحليل_رقم_بنظام_العد("ح٠٠٠٠٠٠٠٠٠٠٠٠٠٠٠٠"؛١٦)
											"""

									,
									new BigInteger("276701161105643274240"),
									null),
					Arguments.of(   true, """
											تحليل_رقم_بنظام_العد("خ٠٠٠٠٠٠٠٠٠٠٠٠٠٠٠٠"؛١٧)
											"""


									,
									new BigInteger("778579070010669895696"),
									null),
					Arguments.of(   true, """
											تحليل_رقم_بنظام_العد("د٠٠٠٠٠٠٠٠٠٠٠٠٠٠٠٠"؛١٨)
											"""


									,
									new BigInteger("2064472028642102280192"),
									null),
					Arguments.of(   true, """
											تحليل_رقم_بنظام_العد("ذ٠٠٠٠٠٠٠٠٠٠٠٠٠٠٠٠"؛١٩)
											"""


									,
									new BigInteger("5191945444217181018258"),
									null),
					Arguments.of(   true, """
											تحليل_رقم_بنظام_العد("ر٠٠٠٠٠٠٠٠٠٠٠٠٠٠٠٠"؛٢٠)
											"""


									,
									new BigInteger("12451840000000000000000"),
									null),
					Arguments.of(   true, """
											تحليل_رقم_بنظام_العد("ز٠٠٠٠٠٠٠٠٠٠٠٠٠٠٠٠"؛٢١)
											"""


									,
									new BigInteger("28611373804839706566420"),
									null),
					Arguments.of(   true, """
											تحليل_رقم_بنظام_العد("س٠٠٠٠٠٠٠٠٠٠٠٠٠٠٠٠"؛٢٢)
											"""


									,
									new BigInteger("63238591423120368009216"),
									null),
					Arguments.of(   true, """
											تحليل_رقم_بنظام_العد("ش٠٠٠٠٠٠٠٠٠٠٠٠٠٠٠٠"؛٢٣)
											"""


									,
									new BigInteger("134917429144981970277142"),
									null),
					Arguments.of(   true, """
											تحليل_رقم_بنظام_العد("ص٠٠٠٠٠٠٠٠٠٠٠٠٠٠٠٠"؛٢٤)
											"""


									,
									new BigInteger("278681220191737450856448"),
									null),
					Arguments.of(   true, """
											تحليل_رقم_بنظام_العد("ض٠٠٠٠٠٠٠٠٠٠٠٠٠٠٠٠"؛٢٥)
											"""


									,
									new BigInteger("558793544769287109375000"),
									null),
					Arguments.of(   true, """
											تحليل_رقم_بنظام_العد("ط٠٠٠٠٠٠٠٠٠٠٠٠٠٠٠٠"؛٢٦)
											"""


									,
									new BigInteger("1090218572485721851494400"),
									null),
					Arguments.of(   true, """
											تحليل_رقم_بنظام_العد("ظ٠٠٠٠٠٠٠٠٠٠٠٠٠٠٠٠"؛٢٧)
											"""


									,
									new BigInteger("2073927519998685256447386"),
									null),
					Arguments.of(   true, """
											تحليل_رقم_بنظام_العد("ع٠٠٠٠٠٠٠٠٠٠٠٠٠٠٠٠"؛٢٨)
											"""


									,
									new BigInteger("3853827448560223562760192"),
									null),
					Arguments.of(   true, """
											تحليل_رقم_بنظام_العد("غ٠٠٠٠٠٠٠٠٠٠٠٠٠٠٠٠"؛٢٩)
											"""


									,
									new BigInteger("7006901263049725766050588"),
									null),
					Arguments.of(   true, """
											تحليل_رقم_بنظام_العد("ف٠٠٠٠٠٠٠٠٠٠٠٠٠٠٠٠"؛٣٠)
											"""


									,
									new BigInteger("12483549090000000000000000"),
									null),
					Arguments.of(   true, """
											تحليل_رقم_بنظام_العد("ق٠٠٠٠٠٠٠٠٠٠٠٠٠٠٠٠"؛٣١)
											"""


									,
									new BigInteger("21822693652415557914854430"),
									null),
					Arguments
							.of(true,
								"""
								تحليل_رقم_بنظام_العد("ك٠٠٠٠٠٠٠٠٠٠٠٠٠٠٠٠"؛٣٢)
								""",
								new BigInteger("37476700408053504415891456"),
								null),
					Arguments.of(true, "و_منطقي(6 ، 3)", 3, null),
					Arguments.of(true, "أو_منطقي(6 ، 3)", 6, null),
					Arguments.of(true, "أس(6 ، 3)", 216.0, null),
					Arguments.of(true, "جمع_عنصر_ب_عنصر(6 ، 3)", 5, null),
					Arguments.of(true, "جمع_عنصر_ب_عنصر(\"666\" ، 3)", "i", null),
					Arguments.of(true, "طرح_عنصر_ب_عنصر(6 ، 3)", -6, null),
					Arguments.of(true, "ضرب_عنصر_ب_عنصر(6 ، 3)", 2, null),
					Arguments.of(true, "ضرب_عنصر_ب_عنصر(\"666\" ، 3)", "ૂ", null),
					Arguments.of(true, "قسمة_عنصر_ب_عنصر(6 ، 3)", 0, null),
					Arguments.of(true, "باقي_القسمة_عنصر_ب_عنصر(6 ، 3)", 2, null),
					Arguments.of(true, "عكس_الإشارة(6)", -6, null),
					Arguments.of(true, "نفي_منطقي(6)", -6, null),
					Arguments.of(true, "ما_حجم(6)", 1, null),
					Arguments.of(true, "ما_نوع(6)", "'أي_عدد'", null),
					Arguments.of(true, "هل_مثيل_من(6 , أي_عدد)", true, null),
					Arguments.of(true, "هل_مثيل_من(6 , أي_نوع)", true, null),
					Arguments.of(true, "ما_نوع(صحيح)", "'بوليان' أو 'منطقي'", null),
					Arguments.of(true, "ما_نوع(خطأ)", "'بوليان' أو 'منطقي'", null),
					Arguments.of(true, "هل_مثيل_من(صحيح , منطقي)", true, null),
					Arguments.of(true, "هل_مثيل_من(صائب , منطقي)", true, null),
					Arguments.of(true, "هل_مثيل_من(حقيقي , منطقي)", true, null),
					Arguments.of(true, "هل_مثيل_من(حقيقي , أي_نوع)", true, null),
					Arguments.of(true, "هل_مثيل_من(خطأ , بوليان)", true, null),
					Arguments.of(true, "هل_مثيل_من(خاطئ , بوليان)", true, null),
					Arguments.of(true, "هل_مثيل_من(زائف , بوليان)", true, null),
					Arguments.of(true, "هل_مثيل_من(زائف , أي_نوع)", true, null),
					Arguments.of(true, "ما_نوع('6')", "'حرف' أو 'رمز'", null),
					Arguments.of(true, "هل_مثيل_من('6' , رمز)", true, null),
					Arguments.of(true, "هل_مثيل_من('6' , حرف)", true, null),
					Arguments.of(true, "هل_مثيل_من('6' , أي_نوع)", true, null),
					Arguments.of(true, "ما_نوع(\"666\")", "'تسلسل_أحرف' أو 'تسلسل_حروف' أو 'تسلسل_رموز'", null),
					Arguments.of(true, "هل_مثيل_من(\"666\" , تسلسل_أحرف)", true, null),
					Arguments.of(true, "هل_مثيل_من(\"666\" , تسلسل_حروف)", true, null),
					Arguments.of(true, "هل_مثيل_من(\"666\" , تسلسل_رموز)", true, null),
					Arguments.of(true, "هل_مثيل_من(\"666\" , أي_نوع)", true, null),
					Arguments.of(true, "ما_نوع(@{})", "'كائن' أو 'هيكل'", null),
					Arguments.of(true, "هل_مثيل_من(@{} , هيكل)", true, null),
					Arguments.of(true, "هل_مثيل_من(@{} , كائن)", true, null),
					Arguments.of(true, """
										متغير شخص: كائن تعيين {
										متغير الاسم: تسلسل_رموز تعيين "أنيس",
										متغير العمر: قصير_جدا تعيين 32,
										متغير متزوج: منطقي تعيين خطأ
										}
										ما_نوع(شخص)""", "'كائن' أو 'هيكل'", null),
					Arguments.of(true, """
										متغير شخص: كائن تعيين {
										متغير الاسم: تسلسل_رموز تعيين "أنيس",
										متغير العمر: قصير_جدا تعيين 32,
										متغير متزوج: منطقي تعيين خطأ
										}
										هل_مثيل_من(شخص , هيكل)""", true, null),
					Arguments.of(true, """
										متغير شخص: كائن تعيين {
										متغير الاسم: تسلسل_رموز تعيين "أنيس",
										متغير العمر: قصير_جدا تعيين 32,
										متغير متزوج: منطقي تعيين خطأ
										}
										هل_مثيل_من(شخص , كائن)""", true, null),
					Arguments
							.of(true,
								"""
								متغير تركيبة_ تعيين (٣٢، ٤٥)
								ما_نوع(تركيبة_)""",
								"'زوج' أو 'مفتاح_و_قيمة' أو 'زوج_مفتاح_و_قيمة'<: 'أي_عدد', 'أي_عدد' :>",
								null),
					Arguments
							.of(true,
								"""
								متغير تركيبة_:زوج<:أي_عدد,أي_عدد:> تعيين (٣٢، ٤٥)
								ما_نوع(تركيبة_)""",
								"'زوج' أو 'مفتاح_و_قيمة' أو 'زوج_مفتاح_و_قيمة'<: 'أي_عدد', 'أي_عدد' :>",
								null),
					Arguments
							.of(true,
								"""
								متغير تركيبة_:زوج_مفتاح_و_قيمة<:عدد_طويل,عدد_طويل:> تعيين (٣٢، ٤٥)
								ما_نوع(تركيبة_)""",
								"'زوج' أو 'مفتاح_و_قيمة' أو 'زوج_مفتاح_و_قيمة'<: 'أي_عدد', 'أي_عدد' :>",
								null),
					Arguments.of(true, """
										متغير تركيبة_ تعيين (٣٢، ٤٥)
										هل_مثيل_من(تركيبة_ , زوج<:أي_عدد,أي_عدد:>)""", true, null),
					Arguments.of(true, """
										متغير تركيبة_ تعيين (٣٢، ٤٥)
										هل_مثيل_من(تركيبة_ , تركيبة)""", true, null),
					Arguments.of(true, """
										متغير تركيبة_:زوج<:أي_عدد,أي_عدد:> تعيين (٣٢، ٤٥)
										هل_مثيل_من(تركيبة_ , زوج_مفتاح_و_قيمة<:عدد_طويل,عدد_طويل:>)""", true, null),
					Arguments.of(true, """
										متغير تركيبة_:زوج_مفتاح_و_قيمة<:عدد_طويل,عدد_طويل:> تعيين (٣٢، ٤٥)
										هل_مثيل_من(تركيبة_ , مفتاح_و_قيمة<:أي_عدد,أي_عدد:>)""", true, null),
					Arguments
							.of(true,
								"""
								متغير تركيبة_ تعيين (٣٢، ٤٥، ٤٥)
								ما_نوع(تركيبة_)""",
								"'ثلاثي' أو 'ثلاثي_القيم'<: 'أي_عدد', 'أي_عدد', 'أي_عدد' :>",
								null),
					Arguments
							.of(true,
								"""
								متغير تركيبة_:ثلاثي_القيم<:أي_عدد,أي_عدد,أي_عدد:> تعيين (٣٢، ٤٥، ٤٥)
								ما_نوع(تركيبة_)""",
								"'ثلاثي' أو 'ثلاثي_القيم'<: 'أي_عدد', 'أي_عدد', 'أي_عدد' :>",
								null),
					Arguments
							.of(true,
								"""
								متغير تركيبة_:ثلاثي_القيم<:عدد_طويل,عدد_طويل,عدد_طويل:> تعيين (٣٢، ٤٥، ٤٥)
								ما_نوع(تركيبة_)""",
								"'ثلاثي' أو 'ثلاثي_القيم'<: 'أي_عدد', 'أي_عدد', 'أي_عدد' :>",
								null),
					Arguments.of(true, """
										متغير تركيبة_ تعيين (٣٢، ٤٥، ٤٥)
										هل_مثيل_من(تركيبة_ , ثلاثي_القيم<:أي_عدد,أي_عدد,أي_عدد:>)""", true, null),
					Arguments.of(true, """
										متغير تركيبة_ تعيين (٣٢، ٤٥، ٤٥)
										هل_مثيل_من(تركيبة_ , تركيبة)""", true, null),
					Arguments
							.of(true,
								"""
								متغير تركيبة_:ثلاثي_القيم<:أي_عدد,أي_عدد,أي_عدد:> تعيين (٣٢، ٤٥، ٤٥)
								هل_مثيل_من(تركيبة_ , ثلاثي_القيم<:عدد_طويل,عدد_طويل,عدد_طويل:>)""",
								true,
								null),
					Arguments.of(true, """
										متغير تركيبة_:ثلاثي_القيم<:عدد_طويل,عدد_طويل,عدد_طويل:> تعيين (٣٢، ٤٥، ٤٥)
										هل_مثيل_من(تركيبة_ , ثلاثي<:أي_عدد,عدد_طويل,أي_عدد:>)""", true, null),
					Arguments.of(true, """
																	ثابت درجات تعيين []
										ما_نوع(درجات)""", "'قائمة'<: 'أي_نوع' أو 'أي_نمط' :>", null),
					Arguments.of(true, """
																	ثابت درجات: قائمة<:أي_عدد:> تعيين [٨٥، ٩٠، ٧٨، ٩٢]
										ما_نوع(درجات)""", "'قائمة'<: 'أي_عدد' :>", null),
					Arguments
							.of(true,
								"""
															ثابت درجات: قائمة<:عدد_طويل_جدا:> تعيين [٨٥، ٩٠، ٧٨، ٩٢]
								ما_نوع(درجات)""",
								"'قائمة'<: 'أي_عدد' :>",
								null),
					Arguments.of(true, """
																	ثابت درجات تعيين []
										هل_مثيل_من(درجات , قائمة<:أي_نمط:>)""", true, null),
					Arguments.of(true, """
																	ثابت درجات: قائمة<:أي_عدد:> تعيين [٨٥، ٩٠، ٧٨، ٩٢]
										هل_مثيل_من(درجات , قائمة<:أي_عدد:>)""", true, null),
					Arguments
							.of(true,
								"""
															ثابت درجات: قائمة<:عدد_طويل_جدا:> تعيين [٨٥، ٩٠، ٧٨، ٩٢]
								هل_مثيل_من(درجات , قائمة<:طويل:>)""",
								true,
								null),


					Arguments.of(true, """
																	ثابت درجات تعيين #{}
										ما_نوع(درجات)""", "'مجموعة'<: 'أي_نوع' أو 'أي_نمط' :>", null),
					Arguments
							.of(true,
								"""
															ثابت درجات: مجموعة<:أي_عدد:> تعيين {٨٥، ٩٠، ٧٨، ٩٢}
								ما_نوع(درجات)""",
								"'مجموعة'<: 'أي_عدد' :>",
								null),
					Arguments
							.of(true,
								"""
															ثابت درجات: مجموعة<:عدد_طويل_جدا:> تعيين {٨٥، ٩٠، ٧٨، ٩٢}
								ما_نوع(درجات)""",
								"'مجموعة'<: 'أي_عدد' :>",
								null),
					Arguments.of(true, """
																	ثابت درجات تعيين #{}
										هل_مثيل_من(درجات , مجموعة<:أي_نمط:>)""", true, null),
					Arguments.of(true, """
																	ثابت درجات: مجموعة<:أي_عدد:> تعيين {٨٥، ٩٠، ٧٨، ٩٢}
										هل_مثيل_من(درجات , مجموعة<:أي_عدد:>)""", true, null),
					Arguments
							.of(true,
								"""
															ثابت درجات: مجموعة<:عدد_طويل_جدا:> تعيين {٨٥، ٩٠، ٧٨، ٩٢}
								هل_مثيل_من(درجات , مجموعة<:طويل:>)""",
								true,
								null),


					Arguments
							.of(true,
								"""
															ثابت درجات تعيين ${}
								ما_نوع(درجات)""",
								"'مصفوفة_ترابطية'<: 'أي_نوع' أو 'أي_نمط', 'أي_نوع' أو 'أي_نمط' :>",
								null),
					Arguments
							.of(true,
								"""
																ثابت درجات: مصفوفة_ترابطية<:تسلسل_أحرف,أي_نوع:> تعيين {
									"الاسم": "سارة",
									"العناوين": ["المنزل", "العمل"],
									"الأرقام": (١٠٠١، ٢٠٠٢)
								}
										ما_نوع(درجات)""",
								"'مصفوفة_ترابطية'<: 'تسلسل_أحرف' أو 'تسلسل_حروف' أو 'تسلسل_رموز', 'أي_نوع' أو " + "'أي_نمط' :>",
								null),
					Arguments
							.of(true,
								"""
																ثابت درجات: مصفوفة_ترابطية<:تسلسل_رموز,أي_نوع:> تعيين {
									"الاسم": "سارة",
									"العناوين": ["المنزل", "العمل"],
									"الأرقام": (١٠٠١، ٢٠٠٢)
								}
										ما_نوع(درجات)""",
								"'مصفوفة_ترابطية'<: 'تسلسل_أحرف' أو 'تسلسل_حروف' أو 'تسلسل_رموز', 'أي_نوع' أو " + "'أي_نمط' :>",
								null),
					Arguments.of(true, """
																	ثابت درجات تعيين ${}
										هل_مثيل_من(درجات , مصفوفة_ترابطية<:أي_نمط,أي_نمط:>)""", true, null),
					Arguments
							.of(true,
								"""
																ثابت درجات: مصفوفة_ترابطية<:تسلسل_حروف,أي_نوع:> تعيين {
									"الاسم": "سارة",
									"العناوين": ["المنزل", "العمل"],
									"الأرقام": (١٠٠١، ٢٠٠٢)
								}
										هل_مثيل_من(درجات , مصفوفة_ترابطية<:تسلسل_رموز,أي_نوع:>)""",
								true,
								null),
					Arguments
							.of(true,
								"""
																ثابت درجات: مصفوفة_ترابطية<:تسلسل_حروف,أي_نوع:> تعيين {
									"الاسم": "سارة",
									"العناوين": ["المنزل", "العمل"],
									"الأرقام": (١٠٠١، ٢٠٠٢)
								}
										هل_مثيل_من(درجات , مصفوفة_ترابطية<:تسلسل_حروف,أي_نوع:>)""",
								true,
								null),
					Arguments.of(true, """
										هل_مثيل_من(مقدار_زمني "مدة 3 ساعات" , مدة)""", true, null),
					Arguments.of(true, """
										هل_مثيل_من(قيمة_زمنية "فترة 14 يوم" , فترة)""", true, null),
					Arguments
							.of(true,
								"""
								هل_مثيل_من(قيمة_زمنية "فترة 14 يوم و 28 ساعات" , فترة_و_مدة)""",
								true,
								null),
					Arguments.of(true, """
										هل_مثيل_من(زمن "١٥ مارس ٢٠٢٣ بالتقويم الميلادي" , تاريخ)""", true, null),
					Arguments.of(true, """
										هل_مثيل_من(زمن "٠٩:٤٥:١٥ بتوقيت دبي" , وقت)""", true, null),
					Arguments
							.of(true,
								"""
								هل_مثيل_من(زمن "١٥ مارس ٢٠٢٣ بالتقويم الميلادي ٠٩:٤٥:١٥ بتوقيت دبي" , تاريخ_و_وقت)""",
								true,
								null),
					Arguments.of(true, """
										ما_نوع(مقدار_زمني "مدة 3 ساعات") """, "'مدة'", null),
					Arguments.of(true, """
										ما_نوع(قيمة_زمنية "فترة 14 يوم") """, "'فترة'", null),
					Arguments.of(true, """
										ما_نوع(قيمة_زمنية "فترة 14 يوم و 28 ساعات") """, "'فترة_و_مدة'", null),
					Arguments.of(true, """
										ما_نوع(زمن "١٥ مارس ٢٠٢٣ بالتقويم الميلادي") """, "'تاريخ'", null),
					Arguments.of(true, """
										ما_نوع(زمن "٠٩:٤٥:١٥ بتوقيت دبي") """, "'وقت'", null),
					Arguments
							.of(true,
								"""
								ما_نوع(زمن "١٥ مارس ٢٠٢٣ بالتقويم الميلادي ٠٩:٤٥:١٥ بتوقيت دبي") """,
								"'تاريخ_و_وقت'",
								null),
					Arguments.of(true, "اقرأ_متغير_بيئة(\"JAVA_HOME\")", System.getenv("JAVA_HOME"), null),
					Arguments.of(true, "اقرأ_خاصية(\"os.name\")", System.getProperty("os.name"), null),
					Arguments.of(true, "اكتب_خاصية(\"my.prop\", \"value\")", None.get(), null),
					Arguments.of(true, "نسخة_جافا()", System.getProperty("java.version"), null),
					Arguments.of(true, "إصدار_نفطه()", NaftahSystem.getVersion(), null),
//					Arguments.of(true, "إصدار_قصير_نفطه()", NaftahSystem.getShortVersion(), null),
					Arguments.of(true, "اسم_النظام()", System.getProperty(OS_NAME_PROPERTY), null),
					Arguments.of(true, "إسم_المستخدم()", System.getProperty("user.name"), null),
					Arguments.of(true, "مجلد_المستخدم()", System.getProperty("user.home"), null),
					Arguments.of(true, "الذاكرة_الإجمالية()", Runtime.getRuntime().totalMemory(), null),
					Arguments.of(true, "ذاكرة_قصوى()", Runtime.getRuntime().maxMemory(), null),
					Arguments.of(true, "عدد_المعالجات()", Runtime.getRuntime().availableProcessors(), null),
					Arguments.of(true, "إجمع({أ:1 , ب:2} , {أ:1 , ب:2})", 6, null),
					Arguments
							.of(true,
								"دوال:الحزم::إجمع({أ:1 , ب:2} , {أ:1 , ب:2})",
								new HashMap<>() {
									{
										put("أ", 2);
										put("ب", 4);
									}
								},
								null),
					Arguments.of(true, "إجمع([1 , 2], [3 , 4])", 10, null),
					Arguments.of(true, "دوال:الحزم::إجمع([1 , 2], [3 , 4])", List.of(4, 6), null),
					Arguments.of(true, "إجمع({1 , 2}, {3 , 5})", 11, null),
					Arguments.of(true, "دوال:الحزم::إجمع({1 , 2}, {3 , 5})", List.of(4, 7), null),
					Arguments.of(true, "إجمع((1 , 2), (1 , 2))", 6, null),
					Arguments.of(true, "دوال:الحزم::إجمع((1 , 2), (1 , 2))", Pair.of(2, 4), null),
					Arguments.of(true, "إجمع([1 ,2 , 3], 10)", 36, null),
					Arguments.of(true, "دوال:الحزم::إجمع([1 ,2 , 3], 10)", List.of(11, 12, 13), null),
					Arguments.of(true, "إجمع(10 , [1 ,2 , 3])", 36, null),
					Arguments.of(true, "دوال:الحزم::إجمع(10 , [1 ,2 , 3])", List.of(11, 12, 13), null),
					Arguments
							.of(false,
								"دوال:الحزم::إجمع(10 , 5)",
								null,
								newNaftahNotCollectionOrMapArgumentError(false)),
					Arguments.of(true, "جمع_عنصر_ب_عنصر({أ:1 , ب:2} , {أ:1 , ب:2})", 0, null),
					Arguments
							.of(true,
								"دوال:الحزم::جمع_عنصر_ب_عنصر({أ:1 , ب:2} , {أ:1 , ب:2})",
								new HashMap<>() {
									{
										put("أ", 0);
										put("ب", 0);
									}
								},
								null),
					Arguments.of(true, "جمع_عنصر_ب_عنصر([1 , 2], [3 , 4])", 8, null),
					Arguments.of(true, "دوال:الحزم::جمع_عنصر_ب_عنصر([1 , 2], [3 , 4])", List.of(2, 6), null),
					Arguments.of(true, "جمع_عنصر_ب_عنصر({1 , 2}, {3 , 5})", 9, null),
					Arguments.of(true, "دوال:الحزم::جمع_عنصر_ب_عنصر({1 , 2}, {3 , 5})", List.of(2, 7), null),
					Arguments.of(true, "جمع_عنصر_ب_عنصر((1 , 2), (1 , 2))", 0, null),
					Arguments.of(true, "دوال:الحزم::جمع_عنصر_ب_عنصر((1 , 2), (1 , 2))", Pair.of(0, 0), null),
					Arguments.of(true, "جمع_عنصر_ب_عنصر([1 ,2 , 3], 10)", 28, null),
					Arguments.of(true, "دوال:الحزم::جمع_عنصر_ب_عنصر([1 ,2 , 3], 10)", List.of(11, 8, 9), null),
					Arguments.of(true, "جمع_عنصر_ب_عنصر(10 , [1 ,2 , 3])", 28, null),
					Arguments.of(true, "دوال:الحزم::جمع_عنصر_ب_عنصر(10 , [1 ,2 , 3])", List.of(11, 8, 9), null),
					Arguments.of(true, "و_منطقي({أ:1 , ب:2} , {أ:1 , ب:2})", 3, null),
					Arguments
							.of(true,
								"دوال:الحزم::و_منطقي({أ:1 , ب:2} , {أ:1 , ب:2})",
								new HashMap<>() {
									{
										put("أ", 1);
										put("ب", 2);
									}
								},
								null),
					Arguments.of(true, "و_منطقي([1 , 2], [3 , 4])", 7, null),
					Arguments.of(true, "دوال:الحزم::و_منطقي([1 , 2], [3 , 4])", List.of(3, 4), null),
					Arguments.of(true, "و_منطقي({1 , 2}, {3 , 5})", 8, null),
					Arguments.of(true, "دوال:الحزم::و_منطقي({1 , 2}, {3 , 5})", List.of(3, 5), null),
					Arguments.of(true, "و_منطقي((1 , 2), (1 , 2))", 3, null),
					Arguments.of(true, "دوال:الحزم::و_منطقي((1 , 2), (1 , 2))", Pair.of(1, 2), null),
					Arguments.of(true, "و_منطقي([1 ,2 , 3], 10)", 30, null),
					Arguments.of(true, "دوال:الحزم::و_منطقي([1 ,2 , 3], 10)", List.of(10, 10, 10), null),
					Arguments.of(true, "و_منطقي(10 , [1 ,2 , 3])", 6, null),
					Arguments.of(true, "دوال:الحزم::و_منطقي(10 , [1 ,2 , 3])", List.of(1, 2, 3), null),
					Arguments.of(true, "أو_منطقي({أ:1 , ب:2} , {أ:1 , ب:2})", 3, null),
					Arguments
							.of(true,
								"دوال:الحزم::أو_منطقي({أ:1 , ب:2} , {أ:1 , ب:2})",
								new HashMap<>() {
									{
										put("أ", 1);
										put("ب", 2);
									}
								},
								null),
					Arguments.of(true, "أو_منطقي([1 , 2], [3 , 4])", 3, null),
					Arguments.of(true, "دوال:الحزم::أو_منطقي([1 , 2], [3 , 4])", List.of(1, 2), null),
					Arguments.of(true, "أو_منطقي({1 , 2}, {3 , 5})", 3, null),
					Arguments.of(true, "دوال:الحزم::أو_منطقي({1 , 2}, {3 , 5})", List.of(1, 2), null),
					Arguments.of(true, "أو_منطقي((1 , 2), (1 , 2))", 3, null),
					Arguments.of(true, "دوال:الحزم::أو_منطقي((1 , 2), (1 , 2))", Pair.of(1, 2), null),
					Arguments.of(true, "أو_منطقي([1 ,2 , 3], 10)", 6, null),
					Arguments.of(true, "دوال:الحزم::أو_منطقي([1 ,2 , 3], 10)", List.of(1, 2, 3), null),
					Arguments.of(true, "أو_منطقي(10 , [1 ,2 , 3])", 30, null),
					Arguments.of(true, "دوال:الحزم::أو_منطقي(10 , [1 ,2 , 3])", List.of(10, 10, 10), null),
					Arguments.of(true, "إطرح({أ:1 , ب:2} , {أ:1 , ب:2})", 0, null),
					Arguments
							.of(true,
								"دوال:الحزم::إطرح({أ:1 , ب:2} , {أ:1 , ب:2})",
								new HashMap<>() {
									{
										put("أ", 0);
										put("ب", 0);
									}
								},
								null),
					Arguments.of(true, "إطرح([1 , 2], [3 , 4])", -4, null),
					Arguments.of(true, "دوال:الحزم::إطرح([1 , 2], [3 , 4])", List.of(-2, -2), null),
					Arguments.of(true, "إطرح({1 , 2}, {3 , 5})", -5, null),
					Arguments.of(true, "دوال:الحزم::إطرح({1 , 2}, {3 , 5})", List.of(-2, -3), null),
					Arguments.of(true, "إطرح((1 , 2), (1 , 2))", 0, null),
					Arguments.of(true, "دوال:الحزم::إطرح((1 , 2), (1 , 2))", Pair.of(0, 0), null),
					Arguments.of(true, "إطرح([1 ,2 , 3], 10)", -24, null),
					Arguments.of(true, "دوال:الحزم::إطرح([1 ,2 , 3], 10)", List.of(-9, -8, -7), null),
					Arguments.of(true, "إطرح(10 , [1 ,2 , 3])", 24, null),
					Arguments.of(true, "دوال:الحزم::إطرح(10 , [1 ,2 , 3])", List.of(9, 8, 7), null),
					Arguments.of(true, "طرح_عنصر_ب_عنصر({أ:1 , ب:2} , {أ:1 , ب:2})", -2, null),
					Arguments
							.of(true,
								"دوال:الحزم::طرح_عنصر_ب_عنصر({أ:1 , ب:2} , {أ:1 , ب:2})",
								new HashMap<>() {
									{
										put("أ", -1);
										put("ب", -1);
									}
								},
								null),
					Arguments.of(true, "طرح_عنصر_ب_عنصر([1 , 2], [3 , 4])", -10, null),
					Arguments.of(true, "دوال:الحزم::طرح_عنصر_ب_عنصر([1 , 2], [3 , 4])", List.of(-3, -7), null),
					Arguments.of(true, "طرح_عنصر_ب_عنصر({1 , 2}, {3 , 5})", -11, null),
					Arguments.of(true, "دوال:الحزم::طرح_عنصر_ب_عنصر({1 , 2}, {3 , 5})", List.of(-3, -8), null),
					Arguments.of(true, "طرح_عنصر_ب_عنصر((1 , 2), (1 , 2))", -2, null),
					Arguments.of(true, "دوال:الحزم::طرح_عنصر_ب_عنصر((1 , 2), (1 , 2))", Pair.of(-1, -1), null),
					Arguments.of(true, "طرح_عنصر_ب_عنصر([1 ,2 , 3], 10)", -31, null),
					Arguments.of(true, "دوال:الحزم::طرح_عنصر_ب_عنصر([1 ,2 , 3], 10)", List.of(-12, -9, -10), null),
					Arguments.of(true, "طرح_عنصر_ب_عنصر(10 , [1 ,2 , 3])", -31, null),
					Arguments
							.of(true,
								"دوال:الحزم::طرح_عنصر_ب_عنصر(10 , [1 ,2 , 3])",
								List.of(-12, -9, -10),
								null),
					Arguments.of(true, "إضرب({أ:1 , ب:2} , {أ:1 , ب:2})", 5, null),
					Arguments
							.of(true,
								"دوال:الحزم::إضرب({أ:1 , ب:2} , {أ:1 , ب:2})",
								new HashMap<>() {
									{
										put("أ", 1);
										put("ب", 4);
									}
								},
								null),
					Arguments.of(true, "إضرب([1 , 2], [3 , 4])", 11, null),
					Arguments.of(true, "دوال:الحزم::إضرب([1 , 2], [3 , 4])", List.of(3, 8), null),
					Arguments.of(true, "إضرب({1 , 2}, {3 , 5})", 13, null),
					Arguments.of(true, "دوال:الحزم::إضرب({1 , 2}, {3 , 5})", List.of(3, 10), null),
					Arguments.of(true, "إضرب((1 , 2), (1 , 2))", 5, null),
					Arguments.of(true, "دوال:الحزم::إضرب((1 , 2), (1 , 2))", Pair.of(1, 4), null),
					Arguments.of(true, "إضرب([1 ,2 , 3], 10)", 60, null),
					Arguments.of(true, "دوال:الحزم::إضرب([1 ,2 , 3], 10)", List.of(10, 20, 30), null),
					Arguments.of(true, "إضرب(10 , [1 ,2 , 3])", 60, null),
					Arguments.of(true, "دوال:الحزم::إضرب(10 , [1 ,2 , 3])", List.of(10, 20, 30), null),
					Arguments.of(true, "ضرب_عنصر_ب_عنصر({أ:1 , ب:2} , {أ:1 , ب:2})", 3, null),
					Arguments
							.of(true,
								"دوال:الحزم::ضرب_عنصر_ب_عنصر({أ:1 , ب:2} , {أ:1 , ب:2})",
								new HashMap<>() {
									{
										put("أ", 1);
										put("ب", 2);
									}
								},
								null),
					Arguments.of(true, "ضرب_عنصر_ب_عنصر([1 , 2], [3 , 4])", 1, null),
					Arguments.of(true, "دوال:الحزم::ضرب_عنصر_ب_عنصر([1 , 2], [3 , 4])", List.of(1, 0), null),
					Arguments.of(true, "ضرب_عنصر_ب_عنصر({1 , 2}, {3 , 5})", 1, null),
					Arguments.of(true, "دوال:الحزم::ضرب_عنصر_ب_عنصر({1 , 2}, {3 , 5})", List.of(1, 0), null),
					Arguments.of(true, "ضرب_عنصر_ب_عنصر((1 , 2), (1 , 2))", 3, null),
					Arguments.of(true, "دوال:الحزم::ضرب_عنصر_ب_عنصر((1 , 2), (1 , 2))", Pair.of(1, 2), null),
					Arguments.of(true, "ضرب_عنصر_ب_عنصر([1 ,2 , 3], 10)", 4, null),
					Arguments
							.of(true,
								"دوال:الحزم::ضرب_عنصر_ب_عنصر([1 ,2 , 3], 10)",
								List.of(0, 2, 2),
								null),
					Arguments.of(true, "ضرب_عنصر_ب_عنصر(10 , [1 ,2 , 3])", 4, null),
					Arguments.of(true, "دوال:الحزم::ضرب_عنصر_ب_عنصر(10 , [1 ,2 , 3])", List.of(0, 2, 2), null),
					Arguments.of(true, "أس({أ:1 , ب:2} , {أ:1 , ب:2})", 5., null),
					Arguments
							.of(true,
								"دوال:الحزم::أس({أ:1 , ب:2} , {أ:1 , ب:2})",
								new HashMap<>() {
									{
										put("أ", 1.);
										put("ب", 4.);
									}
								},
								null),
					Arguments.of(true, "أس([1 , 2], [3 , 4])", 17., null),
					Arguments.of(true, "دوال:الحزم::أس([1 , 2], [3 , 4])", List.of(1., 16.), null),
					Arguments.of(true, "أس({1 , 2}, {3 , 5})", 33., null),
					Arguments.of(true, "دوال:الحزم::أس({1 , 2}, {3 , 5})", List.of(1., 32.), null),
					Arguments.of(true, "أس((1 , 2), (1 , 2))", 5., null),
					Arguments.of(true, "دوال:الحزم::أس((1 , 2), (1 , 2))", Pair.of(1., 4.), null),
					Arguments.of(true, "أس([1 ,2 , 3], 10)", 60074., null),
					Arguments.of(true, "دوال:الحزم::أس([1 ,2 , 3], 10)", List.of(1., 1024., 59049.), null),
					Arguments.of(true, "أس(10 , [1 ,2 , 3])", 1110., null),
					Arguments.of(true, "دوال:الحزم::أس(10 , [1 ,2 , 3])", List.of(10., 100., 1000.), null),
					Arguments.of(true, "إقسم({أ:1 , ب:2} , {أ:1 , ب:2})", 2, null),
					Arguments
							.of(true,
								"دوال:الحزم::إقسم({أ:1 , ب:2} , {أ:1 , ب:2})",
								new HashMap<>() {
									{
										put("أ", 1);
										put("ب", 1);
									}
								},
								null),
					Arguments.of(true, "إقسم([1 , 2], [3 , 4])", 0, null),
					Arguments.of(true, "دوال:الحزم::إقسم([1 , 2], [3 , 4])", List.of(0, 0), null),
					Arguments.of(true, "إقسم({1 , 2}, {3 , 5})", 0, null),
					Arguments.of(true, "دوال:الحزم::إقسم({1 , 2}, {3 , 5})", List.of(0, 0), null),
					Arguments.of(true, "إقسم((1 , 2), (1 , 2))", 2, null),
					Arguments.of(true, "دوال:الحزم::إقسم((1 , 2), (1 , 2))", Pair.of(1, 1), null),
					Arguments.of(true, "إقسم([1 ,2 , 3], 10)", 0, null),
					Arguments.of(true, "دوال:الحزم::إقسم([1 ,2 , 3], 10)", List.of(0, 0, 0), null),
					Arguments.of(true, "إقسم(10 , [1 ,2 , 3])", 18, null),
					Arguments.of(true, "دوال:الحزم::إقسم(10 , [1 ,2 , 3])", List.of(10, 5, 3), null),
					Arguments.of(true, "قسمة_عنصر_ب_عنصر({أ:1 , ب:2} , {أ:1 , ب:2})", 0, null),
					Arguments
							.of(true,
								"دوال:الحزم::قسمة_عنصر_ب_عنصر({أ:1 , ب:2} , {أ:1 , ب:2})",
								new HashMap<>() {
									{
										put("أ", 0);
										put("ب", 0);
									}
								},
								null),
					Arguments.of(true, "قسمة_عنصر_ب_عنصر([1 , 2], [3 , 4])", 0, null),
					Arguments.of(true, "دوال:الحزم::قسمة_عنصر_ب_عنصر([1 , 2], [3 , 4])", List.of(0, 0), null),
					Arguments.of(true, "قسمة_عنصر_ب_عنصر({1 , 2}, {3 , 5})", 0, null),
					Arguments.of(true, "دوال:الحزم::قسمة_عنصر_ب_عنصر({1 , 2}, {3 , 5})", List.of(0, 0), null),
					Arguments.of(true, "قسمة_عنصر_ب_عنصر((1 , 2), (1 , 2))", 0, null),
					Arguments.of(true, "دوال:الحزم::قسمة_عنصر_ب_عنصر((1 , 2), (1 , 2))", Pair.of(0, 0), null),
					Arguments
							.of(false,
								"قسمة_عنصر_ب_عنصر([1 ,2 , 3], 10)",
								null,
								new NaftahBugError(
													new ArithmeticException(
																			String
																					.format("مقدار الإزاحة غير صالح: %d. يجب أن يكون بين 0 و " + "%d.",
																							10,
																							7)))),
					Arguments
							.of(false,
								"دوال:الحزم::قسمة_عنصر_ب_عنصر([1 ,2 , 3], 10)",
								null,
								new NaftahBugError(
													new ArithmeticException(
																			String
																					.format("مقدار الإزاحة غير صالح: %d. يجب أن يكون بين 0 و " + "%d.",
																							10,
																							7)))),
					Arguments.of(true, "قسمة_عنصر_ب_عنصر(10 , [1 ,2 , 3])", 8, null),
					Arguments.of(true, "دوال:الحزم::قسمة_عنصر_ب_عنصر(10 , [1 ,2 , 3])", List.of(5, 2, 1), null),
					Arguments.of(true, "باقي_القسمة({أ:1 , ب:2} , {أ:1 , ب:2})", 0, null),
					Arguments
							.of(true,
								"دوال:الحزم::باقي_القسمة({أ:1 , ب:2} , {أ:1 , ب:2})",
								new HashMap<>() {
									{
										put("أ", 0);
										put("ب", 0);
									}
								},
								null),
					Arguments.of(true, "باقي_القسمة([1 , 2], [3 , 4])", 3, null),
					Arguments.of(true, "دوال:الحزم::باقي_القسمة([1 , 2], [3 , 4])", List.of(1, 2), null),
					Arguments.of(true, "باقي_القسمة({1 , 2}, {3 , 5})", 3, null),
					Arguments.of(true, "دوال:الحزم::باقي_القسمة({1 , 2}, {3 , 5})", List.of(1, 2), null),
					Arguments.of(true, "باقي_القسمة((1 , 2), (1 , 2))", 0, null),
					Arguments.of(true, "دوال:الحزم::باقي_القسمة((1 , 2), (1 , 2))", Pair.of(0, 0), null),
					Arguments.of(true, "باقي_القسمة([1 ,2 , 3], 10)", 6, null),
					Arguments.of(true, "دوال:الحزم::باقي_القسمة([1 ,2 , 3], 10)", List.of(1, 2, 3), null),
					Arguments.of(true, "باقي_القسمة(10 , [1 ,2 , 3])", 1, null),
					Arguments.of(true, "دوال:الحزم::باقي_القسمة(10 , [1 ,2 , 3])", List.of(0, 0, 1), null),
					Arguments.of(true, "باقي_القسمة_عنصر_ب_عنصر({أ:1 , ب:2} , {أ:1 , ب:2})", 0, null),
					Arguments
							.of(true,
								"دوال:الحزم::باقي_القسمة_عنصر_ب_عنصر({أ:1 , ب:2} , {أ:1 , ب:2})",
								new HashMap<>() {
									{
										put("أ", 0);
										put("ب", 0);
									}
								},
								null),
					Arguments.of(true, "باقي_القسمة_عنصر_ب_عنصر([1 , 2], [3 , 4])", 2, null),
					Arguments
							.of(true,
								"دوال:الحزم::باقي_القسمة_عنصر_ب_عنصر([1 , 2], [3 , 4])",
								List.of(0, 2),
								null),
					Arguments.of(true, "باقي_القسمة_عنصر_ب_عنصر({1 , 2}, {3 , 5})", 0, null),
					Arguments
							.of(true,
								"دوال:الحزم::باقي_القسمة_عنصر_ب_عنصر({1 , 2}, {3 , 5})",
								List.of(0, 0),
								null),
					Arguments.of(true, "باقي_القسمة_عنصر_ب_عنصر((1 , 2), (1 , 2))", 0, null),
					Arguments
							.of(true,
								"دوال:الحزم::باقي_القسمة_عنصر_ب_عنصر((1 , 2), (1 , 2))",
								Pair.of(0, 0),
								null),
					Arguments.of(true, "باقي_القسمة_عنصر_ب_عنصر([1 ,2 , 3], 10)", 2, null),
					Arguments
							.of(true,
								"دوال:الحزم::باقي_القسمة_عنصر_ب_عنصر([1 ,2 , 3], 10)",
								List.of(1, 0, 1),
								null),
					Arguments.of(true, "باقي_القسمة_عنصر_ب_عنصر(10 , [1 ,2 , 3])", 2, null),
					Arguments
							.of(true,
								"دوال:الحزم::باقي_القسمة_عنصر_ب_عنصر(10 , [1 ,2 , 3])",
								List.of(0, 0, 2),
								null),
					Arguments.of(true, "هل_يساوي({أ:1 , ب:2} , {أ:1 , ب:2})", true, null),
					Arguments
							.of(true,
								"دوال:الحزم::هل_يساوي({أ:1 , ب:2} , {أ:1 , ب:2})",
								new HashMap<>() {
									{
										put("أ", true);
										put("ب", true);
									}
								},
								null),
					Arguments.of(true, "هل_يساوي([1 , 2], [3 , 4])", false, null),
					Arguments.of(true, "دوال:الحزم::هل_يساوي([1 , 2], [3 , 4])", List.of(false, false), null),
					Arguments.of(true, "هل_يساوي({1 , 2}, {3 , 5})", false, null),
					Arguments.of(true, "دوال:الحزم::هل_يساوي({1 , 2}, {3 , 5})", List.of(false, false), null),
					Arguments.of(true, "هل_يساوي((1 , 2), (1 , 2))", true, null),
					Arguments.of(true, "دوال:الحزم::هل_يساوي((1 , 2), (1 , 2))", Pair.of(true, true), null),
					Arguments.of(true, "هل_يساوي([1 ,2 , 3], 10)", false, null),
					Arguments.of(true, "دوال:الحزم::هل_يساوي([1 ,2 , 3], 10)", List.of(false, false, false), null),
					Arguments.of(true, "هل_يساوي(10 , [1 ,2 , 3])", false, null),
					Arguments
							.of(true,
								"دوال:الحزم::هل_يساوي(10 , [1 ,2 , 3])",
								List.of(false, false, false),
								null),
					Arguments.of(true, "هل_لا_يساوي({أ:1 , ب:2} , {أ:1 , ب:2})", false, null),
					Arguments
							.of(true,
								"دوال:الحزم::هل_لا_يساوي({أ:1 , ب:2} , {أ:1 , ب:2})",
								new HashMap<>() {
									{
										put("أ", false);
										put("ب", false);
									}
								},
								null),
					Arguments.of(true, "هل_لا_يساوي([1 , 2], [3 , 4])", true, null),
					Arguments.of(true, "دوال:الحزم::هل_لا_يساوي([1 , 2], [3 , 4])", List.of(true, true), null),
					Arguments.of(true, "هل_لا_يساوي({1 , 2}, {3 , 5})", true, null),
					Arguments.of(true, "دوال:الحزم::هل_لا_يساوي({1 , 2}, {3 , 5})", List.of(true, true), null),
					Arguments.of(true, "هل_لا_يساوي((1 , 2), (1 , 2))", false, null),
					Arguments.of(true, "دوال:الحزم::هل_لا_يساوي((1 , 2), (1 , 2))", Pair.of(false, false), null),
					Arguments.of(true, "هل_لا_يساوي([1 ,2 , 3], 10)", true, null),
					Arguments.of(true, "دوال:الحزم::هل_لا_يساوي([1 ,2 , 3], 10)", List.of(true, true, true), null),
					Arguments.of(true, "هل_لا_يساوي(10 , [1 ,2 , 3])", true, null),
					Arguments
							.of(true,
								"دوال:الحزم::هل_لا_يساوي(10 , [1 ,2 , 3])",
								List.of(true, true, true),
								null),
					Arguments.of(true, "هل_أصغر_من({أ:1 , ب:2} , {أ:1 , ب:2})", false, null),
					Arguments
							.of(true,
								"دوال:الحزم::هل_أصغر_من({أ:1 , ب:2} , {أ:1 , ب:2})",
								new HashMap<>() {
									{
										put("أ", false);
										put("ب", false);
									}
								},
								null),
					Arguments.of(true, "هل_أصغر_من([1 , 2], [3 , 4])", true, null),
					Arguments.of(true, "دوال:الحزم::هل_أصغر_من([1 , 2], [3 , 4])", List.of(true, true), null),
					Arguments.of(true, "هل_أصغر_من({1 , 2}, {3 , 5})", true, null),
					Arguments.of(true, "دوال:الحزم::هل_أصغر_من({1 , 2}, {3 , 5})", List.of(true, true), null),
					Arguments.of(true, "هل_أصغر_من((1 , 2), (1 , 2))", false, null),
					Arguments.of(true, "دوال:الحزم::هل_أصغر_من((1 , 2), (1 , 2))", Pair.of(false, false), null),
					Arguments.of(true, "هل_أصغر_من([1 ,2 , 3], 10)", true, null),
					Arguments.of(true, "دوال:الحزم::هل_أصغر_من([1 ,2 , 3], 10)", List.of(true, true, true), null),
					Arguments.of(true, "هل_أصغر_من(10 , [1 ,2 , 3])", false, null),
					Arguments
							.of(true,
								"دوال:الحزم::هل_أصغر_من(10 , [1 ,2 , 3])",
								List.of(false, false, false),
								null),
					Arguments.of(true, "هل_أصغر_أو_يساوي({أ:1 , ب:2} , {أ:1 , ب:2})", true, null),
					Arguments
							.of(true,
								"دوال:الحزم::هل_أصغر_أو_يساوي({أ:1 , ب:2} , {أ:1 , ب:2})",
								new HashMap<>() {
									{
										put("أ", true);
										put("ب", true);
									}
								},
								null),
					Arguments.of(true, "هل_أصغر_أو_يساوي([1 , 2], [3 , 4])", true, null),
					Arguments
							.of(true,
								"دوال:الحزم::هل_أصغر_أو_يساوي([1 , 2], [3 , 4])",
								List.of(true, true),
								null),
					Arguments.of(true, "هل_أصغر_أو_يساوي({1 , 2}, {3 , 5})", true, null),
					Arguments
							.of(true,
								"دوال:الحزم::هل_أصغر_أو_يساوي({1 , 2}, {3 , 5})",
								List.of(true, true),
								null),
					Arguments.of(true, "هل_أصغر_أو_يساوي((1 , 2), (1 , 2))", true, null),
					Arguments
							.of(true,
								"دوال:الحزم::هل_أصغر_أو_يساوي((1 , 2), (1 , 2))",
								Pair.of(true, true),
								null),
					Arguments.of(true, "هل_أصغر_أو_يساوي([1 ,2 , 3], 10)", true, null),
					Arguments
							.of(true,
								"دوال:الحزم::هل_أصغر_أو_يساوي([1 ,2 , 3], 10)",
								List.of(true, true, true),
								null),
					Arguments.of(true, "هل_أصغر_أو_يساوي(10 , [1 ,2 , 3])", false, null),
					Arguments
							.of(true,
								"دوال:الحزم::هل_أصغر_أو_يساوي(10 , [1 ,2 , 3])",
								List.of(false, false, false),
								null),
					Arguments.of(true, "هل_أكبر_من({أ:1 , ب:2} , {أ:1 , ب:2})", false, null),
					Arguments
							.of(true,
								"دوال:الحزم::هل_أكبر_من({أ:1 , ب:2} , {أ:1 , ب:2})",
								new HashMap<>() {
									{
										put("أ", false);
										put("ب", false);
									}
								},
								null),
					Arguments.of(true, "هل_أكبر_من([1 , 2], [3 , 4])", false, null),
					Arguments.of(true, "دوال:الحزم::هل_أكبر_من([1 , 2], [3 , 4])", List.of(false, false), null),
					Arguments.of(true, "هل_أكبر_من({1 , 2}, {3 , 5})", false, null),
					Arguments.of(true, "دوال:الحزم::هل_أكبر_من({1 , 2}, {3 , 5})", List.of(false, false), null),
					Arguments.of(true, "هل_أكبر_من((1 , 2), (1 , 2))", false, null),
					Arguments.of(true, "دوال:الحزم::هل_أكبر_من((1 , 2), (1 , 2))", Pair.of(false, false), null),
					Arguments.of(true, "هل_أكبر_من([1 ,2 , 3], 10)", false, null),
					Arguments
							.of(true,
								"دوال:الحزم::هل_أكبر_من([1 ,2 , 3], 10)",
								List.of(false, false, false),
								null),
					Arguments.of(true, "هل_أكبر_من(10 , [1 ,2 , 3])", true, null),
					Arguments
							.of(true,
								"دوال:الحزم::هل_أكبر_من(10 , [1 ,2 , 3])",
								List.of(true, true, true),
								null),
					Arguments.of(true, "هل_أكبر_أو_يساوي({أ:1 , ب:2} , {أ:1 , ب:2})", true, null),
					Arguments
							.of(true,
								"دوال:الحزم::هل_أكبر_أو_يساوي({أ:1 , ب:2} , {أ:1 , ب:2})",
								new HashMap<>() {
									{
										put("أ", true);
										put("ب", true);
									}
								},
								null),
					Arguments.of(true, "هل_أكبر_أو_يساوي([1 , 2], [3 , 4])", false, null),
					Arguments
							.of(true,
								"دوال:الحزم::هل_أكبر_أو_يساوي([1 , 2], [3 , 4])",
								List.of(false, false),
								null),
					Arguments.of(true, "هل_أكبر_أو_يساوي({1 , 2}, {3 , 5})", false, null),
					Arguments
							.of(true,
								"دوال:الحزم::هل_أكبر_أو_يساوي({1 , 2}, {3 , 5})",
								List.of(false, false),
								null),
					Arguments.of(true, "هل_أكبر_أو_يساوي((1 , 2), (1 , 2))", true, null),
					Arguments
							.of(true,
								"دوال:الحزم::هل_أكبر_أو_يساوي((1 , 2), (1 , 2))",
								Pair.of(true, true),
								null),
					Arguments.of(true, "هل_أكبر_أو_يساوي([1 ,2 , 3], 10)", false, null),
					Arguments
							.of(true,
								"دوال:الحزم::هل_أكبر_أو_يساوي([1 ,2 , 3], 10)",
								List.of(false, false, false),
								null),
					Arguments.of(true, "هل_أكبر_أو_يساوي(10 , [1 ,2 , 3])", true, null),
					Arguments
							.of(true,
								"دوال:الحزم::هل_أكبر_أو_يساوي(10 , [1 ,2 , 3])",
								List.of(true, true, true),
								null),
					Arguments.of(true, "أو_بتي({أ:1 , ب:2} , {أ:1 , ب:2})", 3, null),
					Arguments
							.of(true,
								"دوال:الحزم::أو_بتي({أ:1 , ب:2} , {أ:1 , ب:2})",
								new HashMap<>() {
									{
										put("أ", 1);
										put("ب", 2);
									}
								},
								null),
					Arguments.of(true, "أو_بتي([1 , 2], [3 , 4])", 9, null),
					Arguments
							.of(true,
								"دوال:الحزم::أو_بتي([1 , 2], [3 , 4])",
								List.of(3, 6),
								null),
					Arguments.of(true, "أو_بتي({1 , 2}, {3 , 5})", 10, null),
					Arguments
							.of(true,
								"دوال:الحزم::أو_بتي({1 , 2}, {3 , 5})",
								List.of(3, 7),
								null),
					Arguments.of(true, "أو_بتي((1 , 2), (1 , 2))", 3, null),
					Arguments
							.of(true,
								"دوال:الحزم::أو_بتي((1 , 2), (1 , 2))",
								Pair.of(1, 2),
								null),
					Arguments.of(true, "أو_بتي([1 ,2 , 3], 10)", 32, null),
					Arguments
							.of(true,
								"دوال:الحزم::أو_بتي([1 ,2 , 3], 10)",
								List.of(11, 10, 11),
								null),
					Arguments.of(true, "أو_بتي(10 , [1 ,2 , 3])", 32, null),
					Arguments
							.of(true,
								"دوال:الحزم::أو_بتي(10 , [1 ,2 , 3])",
								List.of(11, 10, 11),
								null),
					Arguments.of(true, "حصري_أو_بتي({أ:1 , ب:2} , {أ:1 , ب:2})", 0, null),
					Arguments
							.of(true,
								"دوال:الحزم::حصري_أو_بتي({أ:1 , ب:2} , {أ:1 , ب:2})",
								new HashMap<>() {
									{
										put("أ", 0);
										put("ب", 0);
									}
								},
								null),
					Arguments.of(true, "حصري_أو_بتي([1 , 2], [3 , 4])", 8, null),
					Arguments
							.of(true,
								"دوال:الحزم::حصري_أو_بتي([1 , 2], [3 , 4])",
								List.of(2, 6),
								null),
					Arguments.of(true, "حصري_أو_بتي({1 , 2}, {3 , 5})", 9, null),
					Arguments
							.of(true,
								"دوال:الحزم::حصري_أو_بتي({1 , 2}, {3 , 5})",
								List.of(2, 7),
								null),
					Arguments.of(true, "حصري_أو_بتي((1 , 2), (1 , 2))", 0, null),
					Arguments
							.of(true,
								"دوال:الحزم::حصري_أو_بتي((1 , 2), (1 , 2))",
								Pair.of(0, 0),
								null),
					Arguments.of(true, "حصري_أو_بتي([1 ,2 , 3], 10)", 28, null),
					Arguments
							.of(true,
								"دوال:الحزم::حصري_أو_بتي([1 ,2 , 3], 10)",
								List.of(11, 8, 9),
								null),
					Arguments.of(true, "حصري_أو_بتي(10 , [1 ,2 , 3])", 28, null),
					Arguments
							.of(true,
								"دوال:الحزم::حصري_أو_بتي(10 , [1 ,2 , 3])",
								List.of(11, 8, 9),
								null),
					Arguments.of(true, "و_بتي({أ:1 , ب:2} , {أ:1 , ب:2})", 3, null),
					Arguments
							.of(true,
								"دوال:الحزم::و_بتي({أ:1 , ب:2} , {أ:1 , ب:2})",
								new HashMap<>() {
									{
										put("أ", 1);
										put("ب", 2);
									}
								},
								null),
					Arguments.of(true, "و_بتي([1 , 2], [3 , 4])", 1, null),
					Arguments
							.of(true,
								"دوال:الحزم::و_بتي([1 , 2], [3 , 4])",
								List.of(1, 0),
								null),
					Arguments.of(true, "و_بتي({1 , 2}, {3 , 5})", 1, null),
					Arguments
							.of(true,
								"دوال:الحزم::و_بتي({1 , 2}, {3 , 5})",
								List.of(1, 0),
								null),
					Arguments.of(true, "و_بتي((1 , 2), (1 , 2))", 3, null),
					Arguments
							.of(true,
								"دوال:الحزم::و_بتي((1 , 2), (1 , 2))",
								Pair.of(1, 2),
								null),
					Arguments.of(true, "و_بتي([1 ,2 , 3], 10)", 4, null),
					Arguments
							.of(true,
								"دوال:الحزم::و_بتي([1 ,2 , 3], 10)",
								List.of(0, 2, 2),
								null),
					Arguments.of(true, "و_بتي(10 , [1 ,2 , 3])", 4, null),
					Arguments
							.of(true,
								"دوال:الحزم::و_بتي(10 , [1 ,2 , 3])",
								List.of(0, 2, 2),
								null),
					Arguments.of(true, "ليس_بتي({أ:1 , ب:2})", -5, null),
					Arguments
							.of(true,
								"دوال:الحزم::ليس_بتي({أ:1 , ب:2})",
								new HashMap<>() {
									{
										put("أ", -2);
										put("ب", -3);
									}
								},
								null),
					Arguments.of(true, "ليس_بتي([1 , 2 , 3])", -9, null),
					Arguments
							.of(true,
								"دوال:الحزم::ليس_بتي([1 , 2 , 3])",
								List.of(-2, -3, -4),
								null),
					Arguments.of(true, "ليس_بتي({1 , 2})", -5, null),
					Arguments
							.of(true,
								"دوال:الحزم::ليس_بتي({1 , 2})",
								List.of(-2, -3),
								null),
					Arguments.of(true, "ليس_بتي((1 , 2))", -5, null),
					Arguments
							.of(true,
								"دوال:الحزم::ليس_بتي((1 , 2))",
								Pair.of(-2, -3),
								null),
					Arguments
							.of(false,
								"دوال:الحزم::ليس_بتي(1)",
								null,
								newNaftahNotCollectionOrMapArgumentError(true)),
					Arguments.of(true, "زيادة_قبلية({أ:1 , ب:2})", 5, null),
					Arguments
							.of(true,
								"دوال:الحزم::زيادة_قبلية({أ:1 , ب:2})",
								new HashMap<>() {
									{
										put("أ", 2);
										put("ب", 3);
									}
								},
								null),
					Arguments.of(true, "زيادة_قبلية([1 , 2 , 3])", 9, null),
					Arguments
							.of(true,
								"دوال:الحزم::زيادة_قبلية([1 , 2 , 3])",
								List.of(2, 3, 4),
								null),
					Arguments.of(true, "زيادة_قبلية({1 , 2})", 5, null),
					Arguments
							.of(true,
								"دوال:الحزم::زيادة_قبلية({1 , 2})",
								List.of(2, 3),
								null),
					Arguments.of(true, "زيادة_قبلية((1 , 2))", 5, null),
					Arguments
							.of(true,
								"دوال:الحزم::زيادة_قبلية((1 , 2))",
								Pair.of(2, 3),
								null),
					Arguments.of(true, "زيادة_بعدية({أ:1 , ب:2})", 3, null),
					Arguments
							.of(true,
								"دوال:الحزم::زيادة_بعدية({أ:1 , ب:2})",
								new HashMap<>() {
									{
										put("أ", 1);
										put("ب", 2);
									}
								},
								null),
					Arguments.of(true, "زيادة_بعدية([1 , 2 , 3])", 6, null),
					Arguments
							.of(true,
								"دوال:الحزم::زيادة_بعدية([1 , 2 , 3])",
								List.of(1, 2, 3),
								null),
					Arguments.of(true, "زيادة_بعدية({1 , 2})", 3, null),
					Arguments
							.of(true,
								"دوال:الحزم::زيادة_بعدية({1 , 2})",
								List.of(1, 2),
								null),
					Arguments.of(true, "زيادة_بعدية((1 , 2))", 3, null),
					Arguments
							.of(true,
								"دوال:الحزم::زيادة_بعدية((1 , 2))",
								Pair.of(1, 2),
								null),
					Arguments.of(true, "نقصان_قبلي({أ:1 , ب:2})", 1, null),
					Arguments
							.of(true,
								"دوال:الحزم::نقصان_قبلي({أ:1 , ب:2})",
								new HashMap<>() {
									{
										put("أ", 0);
										put("ب", 1);
									}
								},
								null),
					Arguments.of(true, "نقصان_قبلي([1 , 2 , 3])", 3, null),
					Arguments
							.of(true,
								"دوال:الحزم::نقصان_قبلي([1 , 2 , 3])",
								List.of(0, 1, 2),
								null),
					Arguments.of(true, "نقصان_قبلي({1 , 2})", 1, null),
					Arguments
							.of(true,
								"دوال:الحزم::نقصان_قبلي({1 , 2})",
								List.of(0, 1),
								null),
					Arguments.of(true, "نقصان_قبلي((1 , 2))", 1, null),
					Arguments
							.of(true,
								"دوال:الحزم::نقصان_قبلي((1 , 2))",
								Pair.of(0, 1),
								null),
					Arguments.of(true, "نقصان_بعدي({أ:1 , ب:2})", 3, null),
					Arguments
							.of(true,
								"دوال:الحزم::نقصان_بعدي({أ:1 , ب:2})",
								new HashMap<>() {
									{
										put("أ", 1);
										put("ب", 2);
									}
								},
								null),
					Arguments.of(true, "نقصان_بعدي([1 , 2 , 3])", 6, null),
					Arguments
							.of(true,
								"دوال:الحزم::نقصان_بعدي([1 , 2 , 3])",
								List.of(1, 2, 3),
								null),
					Arguments.of(true, "نقصان_بعدي({1 , 2})", 3, null),
					Arguments
							.of(true,
								"دوال:الحزم::نقصان_بعدي({1 , 2})",
								List.of(1, 2),
								null),
					Arguments.of(true, "نقصان_بعدي((1 , 2))", 3, null),
					Arguments
							.of(true,
								"دوال:الحزم::نقصان_بعدي((1 , 2))",
								Pair.of(1, 2),
								null),

					Arguments.of(true, "عكس_الإشارة({أ:1 , ب:2})", -3, null),
					Arguments
							.of(true,
								"دوال:الحزم::عكس_الإشارة({أ:1 , ب:2})",
								new HashMap<>() {
									{
										put("أ", -1);
										put("ب", -2);
									}
								},
								null),
					Arguments.of(true, "عكس_الإشارة([1 , 2 , 3])", -6, null),
					Arguments
							.of(true,
								"دوال:الحزم::عكس_الإشارة([1 , 2 , 3])",
								List.of(-1, -2, -3),
								null),
					Arguments.of(true, "عكس_الإشارة({1 , 2})", -3, null),
					Arguments
							.of(true,
								"دوال:الحزم::عكس_الإشارة({1 , 2})",
								List.of(-1, -2),
								null),
					Arguments.of(true, "عكس_الإشارة((1 , 2))", -3, null),
					Arguments
							.of(true,
								"دوال:الحزم::عكس_الإشارة((1 , 2))",
								Pair.of(-1, -2),
								null),
					Arguments.of(true, "نفي_منطقي({أ:1 , ب:2})", -3, null),
					Arguments
							.of(true,
								"دوال:الحزم::نفي_منطقي({أ:1 , ب:2})",
								new HashMap<>() {
									{
										put("أ", -1);
										put("ب", -2);
									}
								},
								null),
					Arguments.of(true, "نفي_منطقي([1 , 2 , 3])", -6, null),
					Arguments
							.of(true,
								"دوال:الحزم::نفي_منطقي([1 , 2 , 3])",
								List.of(-1, -2, -3),
								null),
					Arguments.of(true, "نفي_منطقي({1 , 2})", -3, null),
					Arguments
							.of(true,
								"دوال:الحزم::نفي_منطقي({1 , 2})",
								List.of(-1, -2),
								null),
					Arguments.of(true, "نفي_منطقي((1 , 2))", -3, null),
					Arguments
							.of(true,
								"دوال:الحزم::نفي_منطقي((1 , 2))",
								Pair.of(-1, -2),
								null),
					Arguments
							.of(true,
								"""
								متغير قائمة_ تعيين [1 , 2 , 3]
								دوال:الحزم::تعيين_عنصر(قائمة_, 1 , 99)
								قائمة_
								""",
								List.of(1, 99, 3),
								null),
					Arguments
							.of(true,
								"""
								متغير مجموعة_ تعيين {1 , 2}
								دوال:الحزم::تعيين_عنصر(مجموعة_, 1 , 99)
								مجموعة_
								""",
								List.of(1, 99),
								null)

					,
					Arguments
							.of(true,
								"دوال:الحزم::حصول_على_عنصر([1 , 2 , 3], 1)",
								2,
								null),
					Arguments
							.of(true,
								"دوال:الحزم::حصول_على_عنصر((1 , 2), 1)",
								2,
								null),
					Arguments
							.of(true,
								"دوال:الحزم::حصول_على_عنصر({1 , 2}, 1)",
								2,
								null),
					Arguments
							.of(true,
								"إجمع(127 ، 1)::إطرح(1)",
								127,
								null),
					Arguments
							.of(true,
								"دوال:الحزم::إجمع([127؛127] ، 1):::إطرح(1)",
								List.of(127, 127),
								null),
					Arguments
							.of(true,
								"دوال:الحزم::إجمع([127؛127] ، 1)::إطرح(1)",
								254,
								null),
					Arguments
							.of(true,
								"دوال:الحزم::حذف_عنصر_عند_فهرس([1 , 2 , 3], 1)",
								2,
								null),
					Arguments
							.of(true,
								"دوال:الحزم::حذف_عنصر_عند_فهرس({1 , 2}, 0)",
								1,
								null),
					Arguments
							.of(true,
								"دوال:الحزم::يحتوي_عنصر([1 , 2 , 3], 2)",
								true,
								null),
					Arguments
							.of(true,
								"دوال:الحزم::يحتوي_عنصر({ 'أ': 1 , 'ب': 2 }, 2)",
								true,
								null),
					Arguments
							.of(true,
								"دوال:الحزم::يحتوي_عنصر({1 , 2}, 0)",
								false,
								null),
					Arguments
							.of(true,
								"دوال:الحزم::يحتوي_مفتاح({ 'أ': 1 , 'ب': 2 }, 2)",
								false,
								null),
					Arguments
							.of(true,
								"دوال:الحزم::يحتوي_مفتاح({ 'أ': 1 , 'ب': 2 }, 'أ')",
								true,
								null),
					Arguments
							.of(true,
								"""
								ثابت ت تعيين { 'أ': 1 , 'ب': 2 }
								دوال:الحزم::اضافة_عنصر(ت, جافا:أدة:مجرد_خريطة:بسيط_مدخل('ت' , 3))
								ت
								""",
								Map
										.of('أ',
											1,
											'ب',
											2,
											'ت',
											3
										),
								null),
					Arguments
							.of(true,
								"""
								ثابت ت تعيين { 'أ': 1 , 'ب': 2 }
								دوال:الحزم::اضافة_عنصر(ت, جافا:أدة:خريطة::مدخل('ت' , 3))
								ت
								""",
								Map
										.of('أ',
											1,
											'ب',
											2,
											'ت',
											3
										),
								null),
					Arguments
							.of(true,
								"""
								ثابت ت تعيين { 'أ': 1 , 'ب': 2 }
								دوال:الحزم::اضافة_عنصر(ت, ('ت', 3))
								ت
								""",
								Map
										.of('أ',
											1,
											'ب',
											2,
											'ت',
											3
										),
								null),
					Arguments
							.of(true,
								"""
								ثابت ت تعيين [1 , 2]
								دوال:الحزم::اضافة_عنصر(ت, 3)
								ت
								""",
								List.of(1, 2, 3),
								null),
					Arguments
							.of(true,
								"""
								ثابت ت تعيين { 'أ': 1 , 'ب': 2 }
								دوال:الحزم::حذف_عنصر(ت, 'ب')
								ت
								""",
								Map.of('أ', 1),
								null),
					Arguments
							.of(true,
								"""
								ثابت ت تعيين [1 , 2]
								دوال:الحزم::حذف_عنصر(ت, 1)
								ت
								""",
								List.of(2),
								null),
					Arguments
							.of(true,
								"""
								ثابت ت تعيين [1 , 2 , 3]
								دوال:الحزم::الاحتفاظ_بالعناصر(ت, [2, 3, 4])
								ت
								""",
								List.of(2, 3),
								null),
					Arguments
							.of(true,
								"""
								ثابت ت تعيين [1 , 2]
								دوال:الحزم::مسح_المجموعة(ت)
								ت
								""",
								List.of(),
								null),
					Arguments
							.of(true,
								"""
								ثابت ت تعيين { 'أ': 1 , 'ب': 2 }
								دوال:الحزم::مسح_المجموعة(ت)
								ت
								""",
								Map.of(),
								null),
					Arguments
							.of(true,
								"دوال:الخيوط::الخيط_الحالي()",
								NaftahObject.of(Thread.currentThread()),
								null),
					Arguments
							.of(true,
								"دوال:الخيوط::اسم_الخيط(دوال:الخيوط::الخيط_الحالي())",
								Thread.currentThread().getName(),
								null),
					Arguments
							.of(true,
								"دوال:الخيوط::اسم_الخيط_الحالي()",
								Thread.currentThread().getName(),
								null),
					Arguments
							.of(true,
								"""
								دوال:الخيوط::تغيير_اسم_الخيط_الحالي("جديد")
								دوال:الخيوط::اسم_الخيط_الحالي()
								""",
								"جديد",
								null),
					Arguments
							.of(true,
								"""
								دوال:الخيوط::تغيير_اسم_الخيط(دوال:الخيوط::الخيط_الحالي(), "المنفذ-١")
								دوال:الخيوط::اسم_الخيط_الحالي()
								""",
								"المنفذ-١",
								null),
					Arguments
							.of(true,
								"دوال:الخيوط::هل_مقاطع(دوال:الخيوط::الخيط_الحالي())",
								Thread.currentThread().isInterrupted(),
								null),
					Arguments
							.of(true,
								"دوال:الخيوط::هل_الخيط_الحالي_مقاطع()",
								Thread.currentThread().isInterrupted(),
								null),
					Arguments
							.of(true,
								"""
								ثابت خيط تعيين دوال:الخيوط::الخيط_الحالي()
								حاول(دوال:الخيوط::قاطع_الخيط(خيط)){
								نجاح(أ) -> إطبع(أ)
								فشل إفعل إطبع("فشل")
								}
								""",
								None.get(),
								null),
					Arguments
							.of(true,
								"دوال:الخيوط::أولوية_الخيط(دوال:الخيوط::الخيط_الحالي())",
								Thread.currentThread().getPriority(),
								null),
					Arguments
							.of(true,
								"دوال:الخيوط::أولوية_الخيط_الحالي()",
								Thread.currentThread().getPriority(),
								null),
					Arguments
							.of(true,
								"""
								دوال:الخيوط::تغيير_أولوية_الخيط_الحالي(7)
								دوال:الخيوط::أولوية_الخيط_الحالي()
								""",
								7,
								null),
					Arguments
							.of(true,
								"""
								ثابت خيط تعيين دوال:الخيوط::الخيط_الحالي()
								دوال:الخيوط::تغيير_أولوية_الخيط(خيط, 7)
								دوال:الخيوط::أولوية_الخيط_الحالي()
								""",
								7,
								null),
					Arguments
							.of(true,
								"""
								دوال:الخيوط::معرف_الخيط(دوال:الخيوط::الخيط_الحالي())
								""",
								Thread.currentThread().getId(),
								null),
					Arguments
							.of(true,
								"""
								دوال:الخيوط::معرف_الخيط_الحالي()
								""",
								Thread.currentThread().getId(),
								null),
					Arguments
							.of(true,
								"""
								ثابت شغل تعيين تشغيل دوال:الحزم::حصول_على_عنصر([1 , 2 , 3], 1)
								دوال:الخيوط::انتظر(شغل)
								""",
								2,
								null),
					Arguments
							.of(true,
								"""
								ثابت شغل تعيين تشغيل دوال:الحزم::حصول_على_عنصر([1 , 2 , 3], 1)
								دوال:الخيوط::انتظر(شغل)
								دوال:الخيوط::مكتملة(شغل)
								""",
								true,
								null),
					Arguments
							.of(true,
								"""
								ثابت شغل تعيين تشغيل دوال:الحزم::حصول_على_عنصر([1 , 2 , 3], 1)
								دوال:الخيوط::انتظر(شغل)
								دوال:الخيوط::ملغية(شغل)
								""",
								false,
								null),
					Arguments
							.of(true,
								"""
								ثابت شغل تعيين تشغيل دوال:الحزم::حصول_على_عنصر([1 , 2 , 3], 1)
								دوال:الخيوط::معرف_شغل(شغل) لا_يساوي فارغ
								""",
								true,
								null),
					Arguments
							.of(true,
								"""
								ثابت شغل تعيين تشغيل دوال:الحزم::حصول_على_عنصر([1 , 2 , 3], 1)
								دوال:الخيوط::اوقف_المهمة(شغل)
								دوال:الخيوط::المهمة_حية(شغل)
								""",
								true,
								null),
					Arguments
							.of(true,
								"""
								ثابت شغل تعيين تشغيل دوال:الحزم::حصول_على_عنصر([1 , 2 , 3], 1)
								دوال:الخيوط::خيط_المهمة(شغل) لا_يساوي فارغ
								""",
								true,
								null),
					Arguments
							.of(true,
								"""
								ثابت قناة_ = دوال:الخيوط::إنشاء_قناة("أوامر")
								دوال:الخيوط::ارسل(قناة_, 10)
								دوال:الخيوط::استقبل(قناة_)
								""",
								DynamicNumber.of(10),
								null),
					Arguments
							.of(true,
								"""
								ثابت قناة_ = دوال:الخيوط::إنشاء_قناة("أوامر")
								دوال:الخيوط::اسم_القناة(قناة_)
								""",
								"أوامر",
								null),
					Arguments
							.of(true,
								"""
								--- ممثل بسيط يقوم فقط بطباعة الرسائل المستلمة
								ممثل طابعة(رسالة_الطابعة){
								إطبع(رسالة_الطابعة) --- طباعة الرسالة مباشرة
								}
								ثابت ث = دوال:الخيوط::ارسل_للممثل(طابعة, "مرحبا")
								دوال:الخيوط::اوقف_الممثل(طابعة)
								ث
								""",
								true,
								null),
					Arguments
							.of(true,
								"""
								--- ممثل بسيط يقوم فقط بطباعة الرسائل المستلمة
								ممثل طابعة(رسالة_الطابعة){
								إطبع(رسالة_الطابعة) --- طباعة الرسالة مباشرة
								}
								دوال:الخيوط::ممثل_حي(طابعة)
								""",
								true,
								null),
					Arguments
							.of(true,
								"""
								--- ممثل بسيط يقوم فقط بطباعة الرسائل المستلمة
								ممثل طابعة(رسالة_الطابعة){
								إطبع(رسالة_الطابعة) --- طباعة الرسالة مباشرة
								}
								دوال:الخيوط::ممثل_يعمل(طابعة)
								""",
								true,
								null),
					Arguments
							.of(true,
								"""
								--- ممثل بسيط يقوم فقط بطباعة الرسائل المستلمة
								ممثل طابعة(رسالة_الطابعة){
								إطبع(رسالة_الطابعة) --- طباعة الرسالة مباشرة
								}
								دوال:الخيوط::اسم_الممثل(طابعة)
								""",
								"طابعة",
								null),
					Arguments
							.of(true,
								"""
								--- ممثل بسيط يقوم فقط بطباعة الرسائل المستلمة
								ممثل طابعة(رسالة_الطابعة){
								إطبع(رسالة_الطابعة) --- طباعة الرسالة مباشرة
								}
								دوال:الخيوط::خيط_الممثل(طابعة) لا_يساوي فارغ
								""",
								true,
								null),
					Arguments
							.of(false,
								"""
								جافا:لغة:كائن_::ابكديفجهجكلمنوبكرستيفوكسز()
								""",
								null,
								newNaftahInvocableNotFoundError("جافا:لغة:كائن_::ابكديفجهجكلمنوبكرستيفوكسز",
																1,
																0)),
					Arguments
							.of(true,
								"جافا:لغة:الرياضيات::ابس(1):::أميكس(10)",
								NaftahObject.of(10),
								null),
					Arguments
							.of(true,
								"""
								--- java.lang.Math::acos
								جافا:لغة:الرياضيات::اكوس(0،5)
								""",
								NaftahObject.of(1.0471975511965979),
								null),
					Arguments
							.of(true,
								"""
								--- java.lang.Math::asin
								جافا:لغة:الرياضيات::االخطيئة(0،25)
								""",
								NaftahObject.of(0.25268025514207865),
								null),
					Arguments
							.of(true,
								"""
								--- java.lang.Math::atan
								جافا:لغة:الرياضيات::أتاني(1،0)
								""",
								NaftahObject.of(0.7853981633974483),
								null),
					Arguments
							.of(true,
								"""
								--- java.lang.Math::atan2
								جافا:لغة:الرياضيات::أتاني_٢(1،0؛2،0)
								""",
								NaftahObject.of(0.4636476090008061),
								null),
					Arguments
							.of(true,
								"""
								--- java.lang.Math::cbrt
								جافا:لغة:الرياضيات::كبرت(27)
								""",
								NaftahObject.of(3.0),
								null),
					Arguments
							.of(true,
								"""
								--- java.lang.Math::ceil
								جافا:لغة:الرياضيات::سيل(3،14)
								""",
								NaftahObject.of(4.0),
								null),
					Arguments
							.of(true,
								"""
								--- java.util.Objects::checkIndex
								جافا:أدة:الكائنات::شيك_فيدسابق(5؛10)
								جافا:أدة:الكائنات::شيك_فيدسابق:0(5؛10)
								جافا:أدة:الكائنات::شيك_فيدسابق:1(5؛10)
								""",
								NaftahObject.of(5),
								null),
					Arguments
							.of(true,

								"""
								--- java.util.Objects::equals
								جافا:أدة:الكائنات::متساوية("a"؛"b")
								جافا:أدة:الكائنات::متساوية:0("a"؛"b")
								جافا:أدة:الكائنات::متساوية:1("a"؛"b")
								""",
								NaftahObject.of(Boolean.FALSE),
								null),
					Arguments
							.of(true,

								"""
								--- java.util.Objects::deepEquals
								جافا:أدة:الكائنات::عميق_متساوية([1؛2؛3]؛[1؛2؛3])
								""",
								NaftahObject.of(Boolean.TRUE),
								null),
					Arguments
							.of(true,

								"""
								--- java.util.Objects::hash
								جافا:أدة:الكائنات::هتاف(("كائن"؛123؛خاطئ))
								""",
								NaftahObject.of(150903613),
								null),
					Arguments
							.of(true,

								"""
								--- java.util.Objects::hashCode
								جافا:أدة:الكائنات::هتاف_رمز("كائن")
								""",
								NaftahObject.of(49318948),
								null),
					Arguments
							.of(true,

								"""
								--- java.util.Objects::requireNonNull
								حاول(جافا:أدة:الكائنات::الاحتياجات_غير_فارغ(فارغ)){
								نجاح(أ) -> إطبع(أ)
								فشل إفعل إلى_نص("فشل")
								}
								""",
								"فشل",
								null),
					Arguments
							.of(true,

								"""
								--- java.util.Objects::requireNonNullElse
								جافا:أدة:الكائنات::الاحتياجات_غير_فارغ_لس(فارغ؛"جافا")
								""",
								NaftahObject.of("جافا"),
								null),
					Arguments
							.of(true,

								"""
								--- java.util.Objects::toString
								[
								جافا:أدة:الكائنات::إلى_سلسلة(1) ،
								جافا:أدة:الكائنات::إلى_سلسلة:0(1) ،
								جافا:أدة:الكائنات::إلى_سلسلة:1(1؛"2") ،
								جافا:أدة:الكائنات::إلى_سلسلة:1(فارغ؛"2")
								]
								""",
								List
										.of(
											NaftahObject.of("1"),
											NaftahObject.of("1"),
											NaftahObject.of("1"),
											NaftahObject.of("2")
										),
								null),
					Arguments
							.of(true,

								"""
								--- java.util.Objects::isNull
								جافا:أدة:الكائنات::هو_فارغ(فارغ)
								""",
								NaftahObject.of(Boolean.TRUE),
								null),
					Arguments
							.of(true,

								"""
								--- java.util.Objects::nonNull
								جافا:أدة:الكائنات::غير_فارغ(فارغ)
								""",
								NaftahObject.of(Boolean.FALSE),
								null),
					Arguments
							.of(true,

								"""
								---*
								java.util.Objects::compare
								using java.util.Comparator::naturalOrder
								*---
								ثابت مقارن_الترتيب_الطبيعي تعيين جافا:أدة:مقارن::الطبيعية_الأمر()
								جافا:أدة:الكائنات::المقارنة("جافا"؛"جافا"؛مقارن_الترتيب_الطبيعي)
								""",
								NaftahObject.of(0),
								null),
					Arguments
							.of(true,

								"""
								--- java.util.Arrays::asList
								جافا:أدة:صفائف::اس_القائمة([1؛2؛3])
								""",
								NaftahObject.of(List.of(1, 2, 3)),
								null),
					Arguments
							.of(true,

								"""
								--- java.util.Arrays::binarySearch
								جافا:أدة:صفائف::ثنائية_البحث([1؛2؛3]؛3)
								""",
								NaftahObject.of(2),
								null),
					Arguments
							.of(true,

								"""
								--- java.util.Arrays::compare
								[
								جافا:أدة:صفائف::المقارنة([1؛2؛3]؛[1؛2؛3]) ،
								جافا:أدة:صفائف::المقارنة([1؛2؛3]؛[1؛3]) ،
								جافا:أدة:صفائف::المقارنة([1؛2؛3]؛0؛2؛[1؛2]؛0؛2) ،
								جافا:أدة:صفائف::المقارنة([صحيح؛خطأ؛صحيح]؛[حقيقي؛خاطئ؛صائب]) ،
								جافا:أدة:صفائف::المقارنة([صحيح؛خطأ؛صحيح]؛0؛2؛[خطأ؛صحيح]؛0؛2) ،
								جافا:أدة:صفائف::المقارنة(['أ', 'ب', 'ج']؛['أ'؛'ب'؛'ج']) ،
								جافا:أدة:صفائف::المقارنة(['أ', 'ب', 'ج']؛0؛2؛['أ'؛'ب'؛'ج']؛0؛2) ،
								جافا:أدة:صفائف::المقارنة(["كائن", "نفطه", "جافا"]؛["نفطه"؛"جافا"؛"كائن"]) ،
								جافا:أدة:صفائف::المقارنة(["كائن", "نفطه"]؛0؛2؛["نفطه"؛"جافا"؛"كائن"]؛0؛2) ،
								]
								""",
								List
										.of(
											NaftahObject.of(0),
											NaftahObject.of(-1),
											NaftahObject.of(0),
											NaftahObject.of(0),
											NaftahObject.of(1),
											NaftahObject.of(0),
											NaftahObject.of(0),
											NaftahObject.of(-3),
											NaftahObject.of(-3)
										),
								null),
					Arguments
							.of(true,

								"""
								--- java.util.Arrays::copyOfRange
								جافا:أدة:صفائف::نسخ_وف_النطاق([1؛2؛3]؛0؛2)
								""",
								NaftahObject.of(new Float[]{1.F, 2.F}),
								null),
					Arguments
							.of(true,

								"""
								--- java.lang.String::length
								جافا:لغة:سلسلة("مرحبا"):::لنگتهاي()
								""",
								NaftahObject.of(5),
								null),
					Arguments
							.of(true,

								"""
								--- java.lang.String::substring
								جافا:لغة:سلسلة("مرحبا"):::النفقة(1؛3)
								""",
								NaftahObject.of("رح"),
								null),
					Arguments
							.of(true,

								"""
								--- java.lang.List::add
								جافا:أدة:صفائف_القائمة([1؛100؛0]):::إضافة(100)
								""",
								NaftahObject.of(Boolean.TRUE),
								null),
					Arguments
							.of(true,

								"""
								--- java.lang.List::get
								جافا:أدة:صفائف_القائمة([1؛100؛0]):::گت(0)
								""",
								NaftahObject.of(1),
								null),
					Arguments
							.of(true,

								"""
								--- java.lang.List::size
								جافا:أدة:صفائف_القائمة([1؛100؛0]):::الحجم()
								""",
								NaftahObject.of(3),
								null),
					Arguments
							.of(true,

								"""
								--- java.util.Optional::get
								جافا:أدة:اختياري::وف(10):::گت()
								""",
								NaftahObject.of(10),
								null),
					Arguments
							.of(true,

								"""
								--- java.util.Optional::orElse
								جافا:أدة:اختياري::وف_فارغابل(فارغ):::أو_لس("لغة نفطه")
								""",
								NaftahObject.of("لغة نفطه"),
								null),
					Arguments
							.of(true,

								"""
								--- java.lang.String::toString
								جافا:لغة:سلسلة("مرحبا"):::إلى_سلسلة()
								""",
								NaftahObject.of("مرحبا"),
								null),
					Arguments
							.of(true,
								"""
								ثابت سلسلة تعيين جافا:لغة:سلسلة("مرحبا")

								(
								--- java.lang.String::length
								سلسلة::لنگتهاي(),
								--- java.lang.String::substring
								سلسلة::النفقة(1؛3),
								--- java.lang.String::toString
								سلسلة::إلى_سلسلة()
								)
								""",
								Triple
										.of(
											NaftahObject.of(5),
											NaftahObject.of("رح"),
											NaftahObject.of("مرحبا")
										),
								null),
					Arguments
							.of(true,
								"""
								ثابت قائمة_ تعيين جافا:أدة:صفائف_القائمة([1؛100؛0])

								(
								--- java.lang.List::add
								قائمة_::إضافة(100),
								--- java.lang.List::get
								قائمة_::گت(0),
								--- java.lang.List::size
								قائمة_::الحجم()
								)
								""",
								Triple
										.of(
											NaftahObject.of(Boolean.TRUE),
											NaftahObject.of(1),
											NaftahObject.of(3)
										),
								null),
					Arguments
							.of(true,

								"""
								ثابت اختياري تعيين جافا:أدة:اختياري::وف(10)

								(
								--- java.util.Optional::get
								اختياري::گت(),
								--- java.util.Optional::orElse
								اختياري::أو_لس("لغة نفطه")
								)
								""",
								Pair
										.of(
											NaftahObject.of(10),
											NaftahObject.of(10)
										),
								null)
				);
	}
}
