// SPDX-License-Identifier: Apache-2.0
// Copyright © The Naftah Project Authors

package org.daiitech.naftah.parser.provider.script;

import java.math.BigInteger;
import java.util.stream.Stream;

import org.daiitech.naftah.errors.NaftahBugError;
import org.junit.jupiter.api.extension.ExtensionContext;
import org.junit.jupiter.params.provider.Arguments;
import org.junit.jupiter.params.provider.ArgumentsProvider;

public class LogicalExpressionsProvider implements ArgumentsProvider {
	@Override
	public Stream<? extends Arguments> provideArguments(ExtensionContext context) throws Exception {
		return Stream
				.of(Arguments.of(true, "ليس صحيح", false, null),
					Arguments.of(true, "ليس صائب", false, null),
					Arguments.of(true, "ليس حقيقي", false, null),
					Arguments.of(true, "ليس خطأ", true, null),
					Arguments.of(true, "ليس خاطئ", true, null),
					Arguments.of(true, "ليس زائف", true, null),
					Arguments.of(true, "ليس فارغ", true, null),
					Arguments.of(true, "ليس باطل", true, null),
					Arguments.of(true, "ليس لاشيء", true, null),
					Arguments.of(true, "ليس 'ص'", '溜', null),
					Arguments.of(true, "ليس «»", true, null),
					Arguments.of(true, "ليس «اسم»", false, null),
					Arguments.of(true, "ليس 2", -2, null),
					Arguments.of(true, "2 و 2", 2, null),
					Arguments.of(true, "2 أيضا 2", 2, null),
					Arguments.of(true, "2 ايضا ٢", 2, null),
					Arguments.of(true, "2 أيضا ٢", 2, null),
					Arguments.of(true, "2 او 2", 2, null),
					Arguments.of(true, "2 أو 2", 2, null),
					Arguments.of(true, "2 وإلا ٢", 2, null),
					Arguments.of(true, "2 والا ٢", 2, null),
					Arguments.of(true, "2 ولا 2", 2, null),
					Arguments.of(true, "-2 أو 2", 2, null),
					Arguments.of(true, "2 أو -2", 2, null),
					Arguments.of(true, "-2 وإلا ٢", 2, null),
					Arguments.of(true, "2 والا -٢", 2, null),
					Arguments.of(true, "-2 ولا 2", 2, null),
					Arguments.of(true, "-2 او 2", 2, null),
					Arguments.of(true, "2 أو -2", 2, null),
					Arguments.of(true, "-2 وإلا 2", 2, null),
					Arguments.of(true, "2 والا -2", 2, null),
					Arguments.of(true, "-2 ولا 2", 2, null),
					Arguments.of(true, "2 او -2", 2, null),
					Arguments.of(true, "-2 أو 2", 2, null),
					Arguments.of(true, "-2 وإلا 2", 2, null),
					Arguments.of(true, "2 والا -2", 2, null),
					Arguments.of(true, "2 ولا -2", 2, null),
					Arguments.of(true, "2 > 2", false, null),
					Arguments.of(true, "2 أصغر_من 2", false, null),
					Arguments.of(true, "2 => 2", true, null),
					Arguments.of(true, "2 أصغر_أو_يساوي 2", true, null),
					Arguments.of(true, "2 >= 2", true, null),
					Arguments.of(true, "2 أكبر_أو_يساوي 2", true, null),
					Arguments.of(true, "2 =! 2", false, null),
					Arguments.of(true, "2 لا_يساوي 2", false, null),
					Arguments.of(true, "2 == 2", true, null),
					Arguments.of(true, "2 يساوي 2", true, null),
					Arguments.of(true, "2 > 3", true, null),
					Arguments.of(true, "2 أصغر_من 3", true, null),
					Arguments.of(true, "2 < 3", false, null),
					Arguments.of(true, "2 أكبر_من 3", false, null),
					Arguments.of(true, "2 بت_و 2", 2, null),
					Arguments.of(true, "بت_ليس صحيح", false, null),
					Arguments.of(true, "بت_ليس صائب", false, null),
					Arguments.of(true, "بت_ليس حقيقي", false, null),
					Arguments.of(true, "بت_ليس خطأ", true, null),
					Arguments.of(true, "بت_ليس خاطئ", true, null),
					Arguments.of(true, "بت_ليس زائف", true, null),
					Arguments.of(true, "بت_ليس فارغ", -1, null),
					Arguments.of(true, "بت_ليس باطل", -1, null),
					Arguments.of(true, "بت_ليس لاشيء", -1, null),
					Arguments.of(true, "بت_ليس 'ص'", '流', null),
					Arguments.of(true, "بت_ليس «»", "", null),
					Arguments.of(true, "بت_ليس «اسم»", "律琉了", null),
					Arguments.of(true, "بت_ليس 2", -3, null),
					Arguments.of(true, "~2", -3, null),
					Arguments.of(true, "2 بت_ايضا 2", 2, null),
					Arguments.of(true, "2 بت_أيضا 2", 2, null),
					Arguments.of(true, "2 | 2", 2, null),
					Arguments.of(true, "2 بت_أو 2", 2, null),
					Arguments.of(true, "2 بت_او 2", 2, null),
					Arguments.of(true, "2 بت_وإلا 2", 2, null),
					Arguments.of(true, "2 بت_والا 2", 2, null),
					Arguments.of(true, "2 بت_ولا 2", 2, null),
					Arguments.of(true, "2 ^ 2", 0, null),
					Arguments.of(true, "2 بت_أو_حصري 2", 0, null),
					Arguments.of(true, "2 بت_او_حصري 2", 0, null),
					Arguments.of(true, "2 بت_وإلا_حصري 2", 0, null),
					Arguments.of(true, "2 بت_والا_حصري 2", 0, null),
					Arguments.of(true, "2 بت_ولا_حصري 2", 0, null),
					Arguments.of(true, "64 << 2", 256, null),
					Arguments.of(true, "1073741824 << 2", 4294967296L, null),
					Arguments
							.of(true,
								"4611686018427387904 << 2",
								new BigInteger("18446744073709551616"),
								null),
					Arguments
							.of(true,
								"1 << 100",
								new BigInteger("1267650600228229401496703205376"),
								null),
					Arguments
							.of(false,
								"340282346638528859811704183484516925440,000000 << 2",
								null,
								new NaftahBugError( """
													العمليات الثنائية (bitwise) غير مدعومة على الأعداد ذات الفاصلة العشرية:  '340282346638528859811704183484516925440.000000' ،""",
													1,
													0)
							),
					Arguments.of(true, "64 إزاحة_يسار 2", 256, null),
					Arguments.of(true, "1073741824 إزاحة_يسار 2", 4294967296L, null),
					Arguments
							.of(true,
								"4611686018427387904 إزاحة_يسار 2",
								new BigInteger("18446744073709551616"),
								null),
					Arguments
							.of(true,
								"1 إزاحة_يسار 100",
								new BigInteger("1267650600228229401496703205376"),
								null),
					Arguments
							.of(false,
								"340282346638528859811704183484516925440,000000 إزاحة_يسار 2",
								null,
								new NaftahBugError( """
													العمليات الثنائية (bitwise) غير مدعومة على الأعداد ذات الفاصلة العشرية:  '340282346638528859811704183484516925440.000000' ،""",
													1,
													0)
							),
					Arguments
							.of(false,
								"""
								179769313486231570000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000,000000 إزاحة_يسار 2""",
								null,
								new NaftahBugError( """
													العمليات الثنائية (bitwise) غير مدعومة على الأعداد ذات الفاصلة العشرية:  '179769313486231570000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000' ،""",
													1,
													0)),
					Arguments.of(true, "128 إزاحة_يمين 2", 32, null),
					Arguments.of(true, "32768 إزاحة_يمين 2", 8192, null),
					Arguments.of(true, "2147483648 إزاحة_يمين 2", 536870912, null),
					Arguments.of(true, "9223372036854775808 إزاحة_يمين 2", 2305843009213693952L, null),
					Arguments
							.of(false,
								"340282346638528859811704183484516925441,000000 إزاحة_يمين 2",
								null,
								new NaftahBugError( """
													العمليات الثنائية (bitwise) غير مدعومة على الأعداد ذات الفاصلة العشرية:  '340282346638528859811704183484516925441.000000' ،""",
													1,
													0)),
					Arguments

							.of(false,
								"""
								179769313486231570000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000001,000000 إزاحة_يمين 2""",
								null,
								new NaftahBugError( """
													العمليات الثنائية (bitwise) غير مدعومة على الأعداد ذات الفاصلة العشرية:  '179769313486231570000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000001.000000' ،""",
													1,
													0)),
					Arguments.of(true, "128 >> 2", 32, null),
					Arguments.of(true, "32768 >> 2", 8192, null),
					Arguments.of(true, "2147483648 >> 2", 536870912, null),
					Arguments.of(true, "9223372036854775808 >> 2", 2305843009213693952L, null),
					Arguments
							.of(false,
								"340282346638528859811704183484516925441,000000 >> 2",
								null,
								new NaftahBugError( """
													العمليات الثنائية (bitwise) غير مدعومة على الأعداد ذات الفاصلة العشرية:  '340282346638528859811704183484516925441.000000' ،""",
													1,
													0)),
					Arguments
							.of(false,
								"""
								179769313486231570000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000001,000000 >> 2""",
								null,
								new NaftahBugError( """
													العمليات الثنائية (bitwise) غير مدعومة على الأعداد ذات الفاصلة العشرية:  '179769313486231570000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000001.000000' ،""",
													1,
													0)),
					Arguments.of(true, "128 إزاحة_يمين_غير_موقعة 2", 32, null),
					Arguments.of(true, "32768 إزاحة_يمين_غير_موقعة 2", 8192, null),
					Arguments.of(true, "2147483648 إزاحة_يمين_غير_موقعة 2", 536870912, null),
					Arguments
							.of(true,
								"9223372036854775808 إزاحة_يمين_غير_موقعة 2",
								2305843009213693952L,
								null),
					Arguments
							.of(false,
								"340282346638528859811704183484516925441,000000 إزاحة_يمين_غير_موقعة 2",
								null,
								new NaftahBugError( """
													العمليات الثنائية (bitwise) غير مدعومة على الأعداد ذات الفاصلة العشرية:  '340282346638528859811704183484516925441.000000' ،""",
													1,
													0)),
					Arguments
							.of(false,
								"""
								179769313486231570000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000001,000000 إزاحة_يمين_غير_موقعة 2""",
								null,
								new NaftahBugError( """
													العمليات الثنائية (bitwise) غير مدعومة على الأعداد ذات الفاصلة العشرية:  '179769313486231570000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000001.000000' ،""",
													1,
													0)),
					Arguments.of(true, "128 >>> 2", 32, null),
					Arguments.of(true, "32768 >>> 2", 8192, null),
					Arguments.of(true, "2147483648 >>> 2", 536870912, null),
					Arguments
							.of(true,
								"9223372036854775808 >>> 2",
								2305843009213693952L,
								null),
					Arguments
							.of(false,
								"340282346638528859811704183484516925441,000000 >>> 2",
								null,
								new NaftahBugError( """
													العمليات الثنائية (bitwise) غير مدعومة على الأعداد ذات الفاصلة العشرية:  '340282346638528859811704183484516925441.000000' ،""",
													1,
													0)),
					Arguments
							.of(false,
								"""
								179769313486231570000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000001,000000 >>> 2""",
								null,
								new NaftahBugError( """
													العمليات الثنائية (bitwise) غير مدعومة على الأعداد ذات الفاصلة العشرية:  '179769313486231570000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000001.000000' ،""",
													1,
													0)),
					Arguments.of(true, "~((2 بت_ولا_حصري 2) بت_او (2 بت_ولا 2))", -3, null),
					Arguments.of(true, "حجم 6", 1, null),
					Arguments.of(true, "نوع 6", "'أي_عدد'", null),
					Arguments.of(true, "6 مثيل_من أي_عدد", true, null),
					Arguments.of(true, "6 مثيل_من أي_نوع", true, null),
					Arguments.of(true, "نوع صحيح", "'بوليان' أو 'منطقي'", null),
					Arguments.of(true, "نوع خطأ", "'بوليان' أو 'منطقي'", null),
					Arguments.of(true, "صحيح مثيل_من منطقي", true, null),
					Arguments.of(true, "صائب مثيل_من منطقي", true, null),
					Arguments.of(true, "حقيقي مثيل_من منطقي", true, null),
					Arguments.of(true, "حقيقي مثيل_من أي_نوع", true, null),
					Arguments.of(true, "خطأ مثيل_من بوليان", true, null),
					Arguments.of(true, "خاطئ مثيل_من بوليان", true, null),
					Arguments.of(true, "زائف مثيل_من بوليان", true, null),
					Arguments.of(true, "زائف مثيل_من أي_نوع", true, null),
					Arguments.of(true, "نوع '6'", "'حرف' أو 'رمز'", null),
					Arguments.of(true, "'6' مثيل_من رمز", true, null),
					Arguments.of(true, "'6' مثيل_من حرف", true, null),
					Arguments.of(true, "'6' مثيل_من أي_نوع", true, null),
					Arguments.of(true, "نوع \"666\"", "'تسلسل_أحرف' أو 'تسلسل_حروف' أو 'تسلسل_رموز'", null),
					Arguments.of(true, "\"666\" مثيل_من تسلسل_أحرف", true, null),
					Arguments.of(true, "\"666\" مثيل_من تسلسل_حروف", true, null),
					Arguments.of(true, "\"666\" مثيل_من تسلسل_رموز", true, null),
					Arguments.of(true, "\"666\" مثيل_من أي_نوع", true, null),
					Arguments.of(true, "نوع @{}", "'كائن' أو 'هيكل'", null),
					Arguments.of(true, "@{} مثيل_من هيكل", true, null),
					Arguments.of(true, "@{} مثيل_من كائن", true, null),
					Arguments.of(true, """
										متغير شخص: كائن تعيين {
										متغير الاسم: تسلسل_رموز تعيين "أنيس",
										متغير العمر: قصير_جدا تعيين 32,
										متغير متزوج: منطقي تعيين خطأ
										}
										نوع شخص""", "'كائن' أو 'هيكل'", null),
					Arguments.of(true, """
										متغير شخص: كائن تعيين {
										متغير الاسم: تسلسل_رموز تعيين "أنيس",
										متغير العمر: قصير_جدا تعيين 32,
										متغير متزوج: منطقي تعيين خطأ
										}
										شخص مثيل_من هيكل""", true, null),
					Arguments.of(true, """
										متغير شخص: كائن تعيين {
										متغير الاسم: تسلسل_رموز تعيين "أنيس",
										متغير العمر: قصير_جدا تعيين 32,
										متغير متزوج: منطقي تعيين خطأ
										}
										شخص مثيل_من كائن""", true, null),
					Arguments
							.of(true,
								"""
								متغير تركيبة_ تعيين (٣٢، ٤٥)
								نوع تركيبة_""",
								"'زوج' أو 'مفتاح_و_قيمة' أو 'زوج_مفتاح_و_قيمة'<: 'أي_عدد', 'أي_عدد' :>",
								null),
					Arguments
							.of(true,
								"""
								متغير تركيبة_:زوج<:أي_عدد,أي_عدد:> تعيين (٣٢، ٤٥)
								نوع تركيبة_""",
								"'زوج' أو 'مفتاح_و_قيمة' أو 'زوج_مفتاح_و_قيمة'<: 'أي_عدد', 'أي_عدد' :>",
								null),
					Arguments
							.of(true,
								"""
								متغير تركيبة_:زوج_مفتاح_و_قيمة<:عدد_طويل,عدد_طويل:> تعيين (٣٢، ٤٥)
								نوع تركيبة_""",
								"'زوج' أو 'مفتاح_و_قيمة' أو 'زوج_مفتاح_و_قيمة'<: 'أي_عدد', 'أي_عدد' :>",
								null),
					Arguments.of(true, """
										متغير تركيبة_ تعيين (٣٢، ٤٥)
										تركيبة_ مثيل_من زوج<:أي_عدد,أي_عدد:>""", true, null),
					Arguments.of(true, """
										متغير تركيبة_ تعيين (٣٢، ٤٥)
										تركيبة_ مثيل_من تركيبة""", true, null),
					Arguments.of(true, """
										متغير تركيبة_:زوج<:أي_عدد,أي_عدد:> تعيين (٣٢، ٤٥)
										تركيبة_ مثيل_من زوج_مفتاح_و_قيمة<:عدد_طويل,عدد_طويل:>""", true, null),
					Arguments.of(true, """
										متغير تركيبة_:زوج_مفتاح_و_قيمة<:عدد_طويل,عدد_طويل:> تعيين (٣٢، ٤٥)
										تركيبة_ مثيل_من مفتاح_و_قيمة<:أي_عدد,أي_عدد:>""", true, null),
					Arguments
							.of(true,
								"""
								متغير تركيبة_ تعيين (٣٢، ٤٥، ٤٥)
								نوع تركيبة_""",
								"'ثلاثي' أو 'ثلاثي_القيم'<: 'أي_عدد', 'أي_عدد', 'أي_عدد' :>",
								null),
					Arguments
							.of(true,
								"""
								متغير تركيبة_:ثلاثي_القيم<:أي_عدد,أي_عدد,أي_عدد:> تعيين (٣٢، ٤٥، ٤٥)
								نوع تركيبة_""",
								"'ثلاثي' أو 'ثلاثي_القيم'<: 'أي_عدد', 'أي_عدد', 'أي_عدد' :>",
								null),
					Arguments
							.of(true,
								"""
								متغير تركيبة_:ثلاثي_القيم<:عدد_طويل,عدد_طويل,عدد_طويل:> تعيين (٣٢، ٤٥، ٤٥)
								نوع تركيبة_""",
								"'ثلاثي' أو 'ثلاثي_القيم'<: 'أي_عدد', 'أي_عدد', 'أي_عدد' :>",
								null),
					Arguments.of(true, """
										متغير تركيبة_ تعيين (٣٢، ٤٥، ٤٥)
										تركيبة_ مثيل_من ثلاثي_القيم<:أي_عدد,أي_عدد,أي_عدد:>""", true, null),
					Arguments.of(true, """
										متغير تركيبة_ تعيين (٣٢، ٤٥، ٤٥)
										تركيبة_ مثيل_من تركيبة""", true, null),
					Arguments
							.of(true,
								"""
								متغير تركيبة_:ثلاثي_القيم<:أي_عدد,أي_عدد,أي_عدد:> تعيين (٣٢، ٤٥، ٤٥)
								تركيبة_ مثيل_من ثلاثي_القيم<:عدد_طويل,عدد_طويل,عدد_طويل:>""",
								true,
								null),
					Arguments.of(true, """
										متغير تركيبة_:ثلاثي_القيم<:عدد_طويل,عدد_طويل,عدد_طويل:> تعيين (٣٢، ٤٥، ٤٥)
										تركيبة_ مثيل_من ثلاثي<:أي_عدد,عدد_طويل,أي_عدد:>""", true, null),
					Arguments.of(true, """
																	ثابت درجات تعيين []
										نوع درجات""", "'قائمة'<: 'أي_نوع' أو 'أي_نمط' :>", null),
					Arguments.of(true, """
																	ثابت درجات: قائمة<:أي_عدد:> تعيين [٨٥، ٩٠، ٧٨، ٩٢]
										نوع درجات""", "'قائمة'<: 'أي_عدد' :>", null),
					Arguments
							.of(true,
								"""
															ثابت درجات: قائمة<:عدد_طويل_جدا:> تعيين [٨٥، ٩٠، ٧٨، ٩٢]
								نوع درجات""",
								"'قائمة'<: 'أي_عدد' :>",
								null),
					Arguments.of(true, """
																	ثابت درجات تعيين []
										درجات مثيل_من قائمة<:أي_نمط:>""", true, null),
					Arguments.of(true, """
																	ثابت درجات: قائمة<:أي_عدد:> تعيين [٨٥، ٩٠، ٧٨، ٩٢]
										درجات مثيل_من قائمة<:أي_عدد:>""", true, null),
					Arguments
							.of(true,
								"""
															ثابت درجات: قائمة<:عدد_طويل_جدا:> تعيين [٨٥، ٩٠، ٧٨، ٩٢]
								درجات مثيل_من قائمة<:طويل:>""",
								true,
								null),


					Arguments.of(true, """
																	ثابت درجات تعيين #{}
										نوع درجات""", "'مجموعة'<: 'أي_نوع' أو 'أي_نمط' :>", null),
					Arguments
							.of(true,
								"""
															ثابت درجات: مجموعة<:أي_عدد:> تعيين {٨٥، ٩٠، ٧٨، ٩٢}
								نوع درجات""",
								"'مجموعة'<: 'أي_عدد' :>",
								null),
					Arguments
							.of(true,
								"""
															ثابت درجات: مجموعة<:عدد_طويل_جدا:> تعيين {٨٥، ٩٠، ٧٨، ٩٢}
								نوع درجات""",
								"'مجموعة'<: 'أي_عدد' :>",
								null),
					Arguments.of(true, """
																	ثابت درجات تعيين #{}
										درجات مثيل_من مجموعة<:أي_نمط:>""", true, null),
					Arguments.of(true, """
																	ثابت درجات: مجموعة<:أي_عدد:> تعيين {٨٥، ٩٠، ٧٨، ٩٢}
										درجات مثيل_من مجموعة<:أي_عدد:>""", true, null),
					Arguments
							.of(true,
								"""
															ثابت درجات: مجموعة<:عدد_طويل_جدا:> تعيين {٨٥، ٩٠، ٧٨، ٩٢}
								درجات مثيل_من مجموعة<:طويل:>""",
								true,
								null),


					Arguments
							.of(true,
								"""
															ثابت درجات تعيين ${}
								نوع درجات""",
								"'مصفوفة_ترابطية'<: 'أي_نوع' أو 'أي_نمط', 'أي_نوع' أو 'أي_نمط' :>",
								null),
					Arguments
							.of(true,
								"""
																ثابت درجات: مصفوفة_ترابطية<:تسلسل_أحرف,أي_نوع:> تعيين {
									"الاسم": "سارة",
									"العناوين": ["المنزل", "العمل"],
									"الأرقام": (١٠٠١، ٢٠٠٢)
								}
										نوع درجات""",
								"'مصفوفة_ترابطية'<: 'تسلسل_أحرف' أو 'تسلسل_حروف' أو 'تسلسل_رموز', 'أي_نوع' أو " + "'أي_نمط' :>",
								null),
					Arguments
							.of(true,
								"""
																ثابت درجات: مصفوفة_ترابطية<:تسلسل_رموز,أي_نوع:> تعيين {
									"الاسم": "سارة",
									"العناوين": ["المنزل", "العمل"],
									"الأرقام": (١٠٠١، ٢٠٠٢)
								}
										نوع درجات""",
								"'مصفوفة_ترابطية'<: 'تسلسل_أحرف' أو 'تسلسل_حروف' أو 'تسلسل_رموز', 'أي_نوع' أو " + "'أي_نمط' :>",
								null),
					Arguments.of(true, """
																	ثابت درجات تعيين ${}
										درجات مثيل_من مصفوفة_ترابطية<:أي_نمط,أي_نمط:>""", true, null),
					Arguments
							.of(true,
								"""
																ثابت درجات: مصفوفة_ترابطية<:تسلسل_حروف,أي_نوع:> تعيين {
									"الاسم": "سارة",
									"العناوين": ["المنزل", "العمل"],
									"الأرقام": (١٠٠١، ٢٠٠٢)
								}
										درجات مثيل_من مصفوفة_ترابطية<:تسلسل_رموز,أي_نوع:>""",
								true,
								null),
					Arguments
							.of(true,
								"""
																ثابت درجات: مصفوفة_ترابطية<:تسلسل_حروف,أي_نوع:> تعيين {
									"الاسم": "سارة",
									"العناوين": ["المنزل", "العمل"],
									"الأرقام": (١٠٠١، ٢٠٠٢)
								}
										درجات مثيل_من مصفوفة_ترابطية<:تسلسل_حروف,أي_نوع:>""",
								true,
								null),
					Arguments.of(true, """
										مقدار_زمني "مدة 3 ساعات" مثيل_من مدة""", true, null),
					Arguments.of(true, """
										قيمة_زمنية "فترة 14 يوم" مثيل_من فترة""", true, null),
					Arguments.of(true, """
										قيمة_زمنية "فترة 14 يوم و 28 ساعات" مثيل_من فترة_و_مدة""", true, null),
					Arguments.of(true, """
										زمن "١٥ مارس ٢٠٢٣ بالتقويم الميلادي" مثيل_من تاريخ""", true, null),
					Arguments.of(true, """
										زمن "٠٩:٤٥:١٥ بتوقيت دبي" مثيل_من وقت""", true, null),
					Arguments
							.of(true,
								"""
								زمن "١٥ مارس ٢٠٢٣ بالتقويم الميلادي ٠٩:٤٥:١٥ بتوقيت دبي" مثيل_من تاريخ_و_وقت""",
								true,
								null),
					Arguments.of(true, """
										نوع مقدار_زمني "مدة 3 ساعات" """, "'مدة'", null),
					Arguments.of(true, """
										نوع قيمة_زمنية "فترة 14 يوم" """, "'فترة'", null),
					Arguments.of(true, """
										نوع قيمة_زمنية "فترة 14 يوم و 28 ساعات" """, "'فترة_و_مدة'", null),
					Arguments.of(true, """
										نوع زمن "١٥ مارس ٢٠٢٣ بالتقويم الميلادي" """, "'تاريخ'", null),
					Arguments.of(true, """
										نوع زمن "٠٩:٤٥:١٥ بتوقيت دبي" """, "'وقت'", null),
					Arguments
							.of(true,
								"""
								نوع زمن "١٥ مارس ٢٠٢٣ بالتقويم الميلادي ٠٩:٤٥:١٥ بتوقيت دبي" """,
								"'تاريخ_و_وقت'",
								null));
	}
}
